#NOTE all language codes are give according to the ISO-639-1
translations = {
    'no-orders-yet': {
        'en': "You have not yet started setting up your version of Partisan Telegram.",
        'ru': "Вы ещё не начали настраивать Вашу версию Партизанского Телеграма.",
        'be': "Вы яшчэ не пачалі настройваць Вашую версію Партызанскага Тэлеграма.",
        'uk': "Ви ще не почали настроювати Вашу версію Партизанського Телеграма.",
    },
    'canceled': {
        'en': "Your order is canceled. Press the \"{0}\" button to re-set up a masked version of Partisan Telegram or \"{1}\" to clear messages.",
        'ru': "Ваш заказ отменён. Нажмите кнопку \"{0}\" для повторной настройки замаскированной версии Партизанского Телеграма или \"{1}\" для очистки переписки.",
        'be': "Вашая замова скасаваная. Націсніце кнопку \"{0}\" для паўторнай налады замаскіраванай версіі Партызанскага Тэлеграма або \"{1}\" для ачысткі перапіскі.",
        'uk': "Ваше замовлення скасувано. Натисніть кнопку \"{0}\" для повторного налаштування замаскованої версії Партизанського Телеграма або \"{1}\" для очищення листування.",
    },
    'queued': {
        'en': "Your order is queued for build. Your position in the queue: {}.\n\n" +
              "Perhaps you will have to wait for the start of building of the application a considerable time." +
              "You can check the order status and current position in the queue using the /status command. " +
              "Until the app build starts, you can send /cancel and configure all settings again.",
        'ru': "Ваш заказ поставлен в очередь на сборку. Ваша позиция в очереди: {}.\n\n" +
              "Возможно, Вам придётся ждать начала сборки приложения значительное время. " +
              "Вы можете проверить статус заказа и текущую позицию в очереди при помощи команды /status. " +
              "Пока сборка приложения не началась, вы можете отправить /cancel и настроить все параметры заново.",
        'be': "Вашая замова пастаўленая ў чаргу на зборку. Ваша пазіцыя ў чарзе: {}.\n\n" +
              "Магчыма, Вам давядзецца чакаць пачатку зборкі дадатка значны час. " +
              "Вы можаце праверыць статус замовы і бягучую пазіцыю ў чарзе пры дапамозе каманды /status. " +
              "Пакуль зборка дадатка не пачалася, вы можаце адправіць /cancel і наладзіць усе параметры нанова.",
        'uk': "Ваше замовлення поставлено в чергу на збірку. Ваша позиція у черзі: {}.\n\n" +
              "Можливо, Вам доведеться чекати початку складання додатку значний час. "
              "Ви можете перевірити статус замовлення та поточну позицію в черзі за допомогою команди /status. " +
              "Поки збирання додатку не розпочалося, ви можете відправити /cancel і налаштувати всі параметри заново.",
    },
    'app-id-about': {
        'en': "Select the applicationId of the application.\n\n" +
              "Each Android application has an ID (<i>applicationId</i>) - this is a unique identifier of the application on the device. " +
              "There are a few more considerations to take into account when choosing this identifier than when choosing a name. " +
              "On the one hand, if Partisan Telegram is going to mask itself as some other existing application, then it makes sense to copy the applicationId from the app. " +
              "You can see it, for example, in the system settings of the application under which you decided to mask Partisan Telegram." +
              "On the other hand, if an application with the same applicationId is already on your phone, you won’t be able to install Partisan Telegram with the same ID.\n\n" +
              "The application ID often looks like a website's domain name written in reverse order. " +
              "An example of an application ID: org.telegram.messenger — Telegram's applicationId. " +
              "The top-level domain (com/org/ru/by/us) is usually written at the beginning. " +
              "Then there may be the name of the company that developed the application. " +
              "After that, the name of the application itself. There may be some postfix at the end. For example, \"android\" or \"messenger\", as in the case of Telegram.\n\n" +
              "The applicationId will remain unchanged for the masked application. If you want to change it, you will need to build a new application and transfer the data to it.\n\n" +
              "We understand that it can be difficult to understand how to write an application id. Therefore, we have generated several examples based on the name of your application. " +
              "You can choose one of them or write your own applicationId.",
        'ru': "Выберите applicationId приложения.\n\n" +
              "У каждого Android приложения есть ID (<i>applicationId</i>) — это уникальный идентификатор приложения на устройстве. " +
              "При выборе этого идентификатора необходимо учитывать немного больше нюансов, чем при выборе названия. " +
              "С одной стороны, если Партизанский Телеграм будет маскироваться под другое существующее приложение, то имеет смысл скопировать applicationId этого приложения. " +
              "Вы можете посмотреть его, например, в системых настройках приложения, под которое решили маскировать Партизанский Телеграм. " +
              "С другой стороны, если приложение с таким же applicationId уже имеется на Вашем телефоне, установить Партизанский Телеграм с таким же идентификатором не выйдет.\n\n" +
              "Идентификатор приложения часто выглядит как доменное имя сайта, записанное с обратным порядком слов. " +
              "Пример идентификатора приложения: org.telegram.messenger — applicationId Телеграма. "+
              "В начале обычно пишется домен верхнего уровня (com/org/ru/by/us). " +
              "Затем может идти название компании, которая разработала приложение. " +
              "После этого - название самого приложения. В конце может быть какой-нибудь постфикс. Например, \"android\" или \"messenger\", как в случае Телеграма.\n\n" +
              "ApplicationId будет оставаться неизменным у замаскированного приложения. Если вы захотите его изменить, нужно будет собрать новое приложение и перенести в него данные.\n\n" +
              "Мы понимаем, что может быть сложно понять, как написать id приложения. Поэтому сгенерировали несколько примеров на основе названия Вашего приложения. " +
              "Вы можете выбрать один из них или написать свой applicationId.",
        'be': "Абярыце applicationId дадатка.\n\n" +
              "У кожнага Android дадатка ёсць ID (<i>applicationId</i>) - гэта ўнікальны ідэнтыфікатар дадатка на прыладзе. " +
              "Пры выбары гэтага ідэнтыфікатара неабходна ўлічваць крыху больш нюансаў, чым пры выбары назвы. "
              "З аднаго боку, калі Партызанскі Тэлеграм будзе маскіравацца пад іншы існуючы дадатак, то мае сэнс скапіяваць applicationId гэтага дадатка. " +
              "Вы можаце паглядзець яго, напрыклад, у сістэмах наладах дадатка, пад які вырашылі маскіраваць Партызанскі Тэлеграм."
              "З іншага боку, калі дадатак з такім жа applicationId ужо ёсць на Вашым тэлефоне, усталяваць Партызанскі Тэлеграм з такім жа ідэнтыфікатарам не выйдзе.\n\n" +
              "Ідэнтыфікатар дадатка часта выглядае як даменнае імя сайта, запісанае са зваротным парадкам слоў. " +
              "Прыклад ідэнтыфікатара дадатка: org.telegram.messenger — applicationId Тэлеграма. " +
              "Напачатку звычайна пішацца дамен верхняга ўзроўня (com/org/ru/by/us). " +
              "Затым можа ісці назву кампаніі, якая распрацавала дадатак. " +
              "Пасля гэтага - назва самога дадатка. У канцы можа быць які-небудзь постфікс. Напрыклад, \"android\" або \"messenger\", як у выпадку Тэлеграма.\n\n" +
              "ApplicationId будзе заставацца нязменным у замаскіраванага дадатка. Калі вы захочаце яго змяніць, трэба будзе сабраць новы дадатак і перанесці ў яго дадзеныя.\n\n" +
              "Мы разумеем, што можа быць складана зразумець, як напісаць id дадатку. Таму згенеравалі некалькі прыкладаў на аснове назвы Вашага дадатка. " +
              "Вы можаце выбраць адзін з іх ці напісаць свой applicationId.",
        'uk': "Виберіть applicationId додатку.\n\n" +
              "У кожного Android додатка є ID (<i>applicationId</i>) — це унікальний ідентифікатор додатку на пристрої. " +
              "При виборі цього ідентифікатора необхідно враховувати трохи більше нюансів, ніж при виборі назви. " +
              "З одного боку, якщо Партизанський Телеграм буде маскуватися під якийсь інший існуючий додаток, то має сенс скопіювати applicationId цього додатку. " +
              "Ви можете подивитися його, наприклад, у системах налаштування додатку, під який вирішили маскувати Партизанський Телеграм." +
              "З іншого боку, якщо додаток з applicationId вже є на Вашому телефоні, встановити Партизанський Телеграм з таким же ідентифікатором не вийде.\n\n" +
              "Ідентифікатор додатку часто виглядає як доменне ім'я сайту, записане зі зворотним порядком слів. " +
              "Приклад ідентифікатора додатку: org.telegram.messenger — applicationId Телеграма. " +
              "На початку зазвичай пишеться домен верхнього рівня (com/org/ru/by/us). " +
              "Потім може йти назва компанії, яка розробила додаток. " +
              "Після цього - назва самого додатка. Наприкінці може бути якийсь постфікс. Наприклад, \"android\" або \"messenger\", як у випадку Телеграма. \n\n" +
              "ApplicationId залишатиметься незмінним у замаскованом додатку. Якщо ви захочете його змінити, потрібно буде зібрати новий додаток і перенести в нього дані.\n\n" +
              "Ми розуміємо, що може бути складно зрозуміти, як написати id додатку. Тому згенерували кілька прикладів на основі назви Вашого додатка. " +
              "Ви можете вибрати один з них або написати свій applicationId.",
    },
    'custom-app-id': {
        'en': 'Enter...',
        'ru': 'Ввести...',
        'be': 'Увесьці...',
        'uk': 'Ввести...',
    },
    'ask-custom-app-id': {
        'en': "Please enter the <i>applicationId</i>.\n"
              "Example of a correct ID: <code>{0}</code>.",
        'ru': "Пожалуйста, введите <i>applicationId</i>.\n"
              "Пример правильного ID: <code>{0}</code>.",
        'be': "Калі ласка, увядзіце <i>applicationId</i>.\n"
              "Прыклад правільнага ID: <code>{0}</code>.",
        'uk': "Будь ласка, введіть <i>applicationId</i>.\n"
              "Приклад правильного ID: <code>{0}</code>.",
    },
    'invalid-app-id': {
        'en': "Invalid application ID.\n"
              "See more information <a href=\"{0}\">here</a>.",
        'ru': "Недопустимый ID приложения.\n"
              "Смотрите больше информации <a href=\"{0}\">здесь</a>.",
        'be': "Недапушчальны ID дадатка.\n"
              "Глядзіце больш інфармацыі <a href=\"{0}\">тут</a>.",
        'uk': "Недопустимий ID додатку.\n"
              "Дивіться більше інформаціі <a href=\"{0}\">тут</a>.",
    },
    'ask-icon': {
        'en': "Please upload the image you want to make the app icon.\n\n" +
              "You can upload the image as a picture or an uncompressed file. It is preferable that the image is square.\n\n" +
              "The application will automatically use the appropriate icon shape for your phone. " +
              "That is, if your application icons are square with rounded corners, then the icon of the masked Partisan Telegram will also be of this shape.\n\n" +
              "For good application masking, the icon should match the passcode entry screen and the name. " +
              "For example, if you have chosen \"Calculator\" passcode entry screen, then the icon should be somehow related to the calculator. " +
              "If you have chosen a game as the name, then the icon should be the same as that game.\n\n" +
              "In the image above, you can see approximately what the current icon will look like. " +
              "If you want to keep it, click the button under this message.",
        'ru': "Пожалуйста, загрузите изображение, которое хотите сделать иконкой приложения.\n\n" +
              "Вы можете загрузить изображение в виде картинки или несжатого файла. Желательно, чтобы изображение было квадратным.\n\n" +
              "Приложение автоматически будет использовать подходящую форму иконки для Вашего телефона. " +
              "То есть, если у вас иконки приложений квадратные со скруглёнными углами, то иконка замаскированного Партизанского Телеграма будет такой же формы.\n\n" +
              "Для хорошей маскировки приложения иконка должна сочетаться с экраном ввода код-пароля и названием. " +
              "Например, если Вы выбрали экран ввода код-пароля \"Calculator\", то иконка должна быть как-то связана с калькулятором. " +
              "Если Вы выбрали в качестве названия какую-нибудь игру, то иконку стоит использовать такую же, как у этой игры.\n\n" +
              "На изображении выше Вы можете увидеть, как примерно будет выглядеть текущая иконка. " +
              "Если Вы хотите её оставить, нажмите на кнопку под этим сообщением.",
        'be': "Калі ласка, загрузіце выяву, якую хочаце зрабіць іконкай дадатка.\n\n" +
              "Вы можаце загрузіць малюнак у выглядзе карцінкі або несціснутага файла. Пажадана, каб выява была квадратнай.\n\n" +
              "Дадатак аўтаматычна будзе выкарыстоўваць прыдатную форму іконкі для Вашага тэлефона. " +
              "Гэта значыць, калі ў вас іконкі дадаткаў квадратныя са скругленымі  кутамі, то іконка замаскіраванага Партызанскага Тэлеграма будзе такой жа формы.\n\n" +
              "Для добрай маскіроўкі дадатка іконка павінна спалучацца з экранам уводу кода блакіроўкі і назвай. " +
              "Напрыклад, калі Вы выбралі экран уводу кода блакіроўкі \"Calculator\", то іконка павінна быць неяк звязана з калькулятарам. " +
              "Калі Вы выбралі ў якасці назвы якую-небудзь гульню, то іконку варта выкарыстоўваць такі ж, як у гэтай гульні.\n\n" +
              "На малюнку вышэй Вы можаце ўбачыць, як прыкладна будзе выглядаць бягучая іконка. " +
              "Калі Вы жадаеце яе пакінуць, націсніце на кнопку пад гэтым паведамленнем.",
        'uk': "Будь ласка, завантажте зображення, яке хочете зробити іконкою додатку.\n\n" +
              "Ви можете завантажити зображення у вигляді картинки або стисненого файлу. Бажано, щоб зображення було квадратним.\n\n" +
              "Додаток автоматично використовуватиме відповідну форму іконки для Вашого телефону. " +
              "Тобто якщо у вас іконки додатків квадратні із округленими кутами, то іконка замаскованого Партизанського Телеграма буде такої ж форми.\n\n"
              "Для хорошого маскування додатку іконка повинна поєднуватися з екраном введення коду блокування та назвою. "
              "Наприклад, якщо Ви вибрали екран введення коду блокування \"Calculator\", то іконка має бути якось пов'язана з калькулятором. " +
              "Якщо Ви вибрали в якості назви якусь гру, то іконку варто використовувати таку ж, як у цієї гри.\n\n"
              "На зображенні вище Ви можете побачити, як буде виглядати поточна іконка. " +
              "Якщо Ви хочете залишити її, натисніть кнопку під цим повідомленням.",
    },
    'file-too-big': {
        'en': "Your file is too big. Please send a file smaller than {} MB.",
        'ru': "Ваш файл слишком большой. Пожалуйста, загрузите файл меньше {} МБ.",
        'be': "Ваш файл занадта вялікі. Калі ласка, загрузіце файл меншы за {} МБ.",
        'uk': "Ваш файл занадто великий. Будь ласка, завантажте файл менший за {} МБ.",
    },
    'file-is-not-image': {
        'en': "The file is not an image.",
        'ru': "Файл не является изображением.",
        'be': "Файл не з'яўляецца выявай.",
        'uk': "Файл не є зображенням.",
    },
    'grouped-images-are-not-allowed': {
        'en': "You only need to send one image.",
        'ru': "Необходимо прислать только одно изображение.",
        'be': "Неабходна даслаць толькі адну выяву.",
        'uk': "Необхідно надіслати лише одне зображення.",
    },
    'request-generated': {
        'en': "We've randomly selected some settings for your masked version of the app. You can leave them as is or change them.",
        'ru': "Мы случайным образом выбрали настройки для Вашей замаскированной версии приложения. Вы можете оставить их в таком виде или изменить.",
        'be': "Мы выпадковым чынам выбралі наладкі для Вашай замаскіраванай версіі дадатка. Вы можаце пакінуць іх у такім выглядзе ці змяніць.",
        'uk': "Ми випадково вибрали налаштування для вашої замаскованої версії додатку. Ви можете залишити їх у такому вигляді або змінити.",
    },
    'request-confirmation': {
        'en': "Your app currently has the following settings:\n" +
              "🔹Type of masked passcode entry screen: {}\n" +
              "🔹Name: {}\n" +
              "🔹ApplicationId (package name) {}\n" +
              "🔹Version name: {}\n" +
              "🔹Version number: {}\n" +
              "🔹Notification text: {}\n" +
              "🔹Available app permissions: {}\n" +
              "🔹Unavailable app permissions: {}\n" +
              "🔹Primary color (for buttons on the masked passcode entry screen, notification icons, etc.): {}\n\n" +
              "You may not understand everything written above. " +
              "If you want to understand each item, click the <i>{}</i> button. " +
              "Then the bot will explain each setting and allow you to change it. " +
              "And if you want to leave the settings suggested by the bot, press <i>{}</i>.",
        'ru': "Сейчас у Вашего приложения такие настройки:\n" +
              "🔹Тип замаскированного экрана ввода код-пароля: {}\n" +
              "🔹Название: {}\n" +
              "🔹ApplicationId (имя пакета) {}\n" +
              "🔹Название версии: {}\n" +
              "🔹Номер версии: {}\n" +
              "🔹Текст уведомления: {}\n" +
              "🔹Доступные разрешения приложения: {}\n" +
              "🔹Недоступные разрешения приложения: {}\n" +
              "🔹Основной цвет (для кнопок на замаскированном экране ввода код-пароля, иконки уведомлений и др.): {}\n\n" +
              "Возможно, Вы не всё понимаете из написанного выше. " +
              "Если хотите разобраться с каждым пунктом, нажмите кнопку <i>{}</i>. " +
              "Тогда бот объяснит каждую настройку и позволит её изменить. " +
              "А если хотите оставить настройки, предложенные ботом, нажмите <i>{}</i>.",
        'be': "Цяпер у Вашага дадатка такія наладкі:\n" +
              "🔹Тып замаскіраванага экрана ўводу кода блакіроўкі: {}\n" +
              "🔹Назва: {}\n" +
              "🔹ApplicationId (імя пакета) {}\n" +
              "🔹Назва версіі: {}\n" +
              "🔹Нумар версіі: {}\n" +
              "🔹Тэкст апавяшчэння: {}\n" +
              "🔹Даступныя дазволы дадатка: {}\n" +
              "🔹Недаступныя дазволы дадатка: {}\n" +
              "🔹Асноўны колер (для кнопак на замаскіраваным экране ўводу кода блакіроўкі, абразкі апавяшчэнняў і інш.): {}\n\n" +
              "Магчыма, Вы не ўсё разумееце з напісанага вышэй."
              "Калі хочаце разабрацца з кожным пунктам, націсніце кнопку <i>{}</i>. " +
              "Тады бот растлумачыць кожную наладу і дазволіць яе змяніць. " +
              "А калі жадаеце пакінуць налады, прапанаваныя ботам, націсніце <i>{}</i>.",
        'uk': "Зараз у Вашого додатку такі настройки:\n" +
              "🔹Тип замаскованого екрана введення коду блокування: {}\n" +
              "🔹Назва: {}\n" +
              "🔹ApplicationId (ім'я пакета) {}\n" +
              "🔹Назва версії: {}\n" +
              "🔹Номер версії: {}\n" +
              "🔹Текст повідомлення: {}\n" +
              "🔹Доступні дозволи додатку: {}\n" +
              "🔹Недоступні дозволи додатку: {}\n" +
              "🔹Основний колір (для кнопок на замаскованому екрані введення коду блокування, іконки повідомлень та ін.): {}\n\n" +
              "Можливо, Ви не все розумієте з написаного вище."
              "Якщо хочете розібратися з кожним пунктом, натисніть кнопку <i>{}</i>. " +
              "Тоді бот пояснить кожну настройку і дозволить її змінити. "
              "А якщо хочете залишити налаштування, запропоновані ботом, натисніть <i>{}</i>.",
    },
    'confirmed': {
        'en': "Your order is confirmed.",
        'ru': "Ваш заказ подтверждён.",
        'be': "Вашая замова пацверджаная.",
        'uk': "Ваше замовлення підтверджено.",
    },
    'awaiting-build': {
        'en': "Your order is awaiting build. If you want to cancel the build please send /cancel.",
        'ru': "Ваш заказ ожидает сборки. Если Вы хотите отменить сборку, пожалуйста, отправьте /cancel.",
        'be': "Вашая замова чакае зборкі. Калі Вы хаціце скасаваць зборку, калі ласка, дашліце /cancel.",
        'uk': "Ваше замовлення чекає на збірку. Якщо Ви хочете скасувати збірку, будь ласка, відправте /cancel.",
    },
    'build-started': {
        'en': "Build of your order is started. It will take a considerable amount of time. Up to an hour, and sometimes up to several hours. " +
              "Please wait until it is finished and do not block the bot.",
        'ru': "Сборка вашего заказа началась. Она займёт значительное время. До часа, а иногда и до нескольких часов. " +
              "Пожалуйста, дождитесь завершения и не блокируйте бот.",
        'be': "Зборка вашае замовы пачалася, яна зойме некаторы час. Яна зойме значны час. Да гадзіны, а часам і да некалькіх гадзін. " +
              "Калі ласка, дачакайцеся завяршэння і не блакуйце бот.",
        'uk': "Збірка вашого замовлення почалася. Вона займе значний час. До години, а іноді й за кілька годин. " +
              "Будь ласка, дочекайтеся завершення і не блокуйте бот.",
    },
    'is-building': {
        'en': "Your order is being built.",
        'ru': "Ваш заказ собирается.",
        'be': "Вашая замова збіраецца.",
        'uk': "Ваше замовлення збирається."
    },
    'build-failed': {
        'en': "Build failed.",
        'ru': "Сборка не удалась.",
        'be': "Зборка не ўдалася.",
        'uk': "Збірка не вдалася."
    },
    'retry-build': {
        'en': "Retry build",
        'ru': "Попробовать заново",
        'be': "Паспрабаваць нанова",
        'uk': "Спробувати заново",
    },
    'cancel-order': {
        'en': "Cancel order",
        'ru': "Отменить заказ",
        'be': "Скасаваць замову",
        'uk': "Скасувати замовлення",
    },
    'welcome': {
        'en': "Welcome!\n" +
              "This bot will help you set up your own version of Partisan Telegram:\n" +
              "1. Select a start screen for entering a passcode with masking for different applications.\n" +
              "2. Set an icon and name with mask for different applications.\n" +
              "3. Select other necessary parameters.\n\n" +
              "Thanks to this, when checking your phone, it will be much more difficult for security forces and intelligence officers to identify, " +
              "that you are using Partisan Telegram, since the messenger will look like another application of your choice.\n" +
              "<b>BUT!</b> If the phone is taken for a detailed forensic analysis, there is a considerable chance, " +
              "that specialists will recognize that Partisan Telegram is installed.\n\n" +
              "To continue, click the button below.",
        'ru': "Здравствуйте!\n" +
              "Этот бот поможет вам настроить собственную версию Партизанского Телеграма:\n" +
              "1. Выбрать стартовый экран для ввода код-пароля с маскировкой под разные приложения.\n" +
              "2. Задать иконку и название с маскировкой под разные приложения.\n" +
              "3. Выбрать другие необходимые параметры.\n\n" +
              "Благодаря этому силовикам и сотрудникам спецслужб будет значительно сложнее узнать, " +
              "что вы пользуетесь Партизанским Телеграмом, т. к. мессенджер внешне будет похож на другое приложение по вашему выбору.\n" +
              "<b>НО!</b> Если телефон заберут на детальный криминалистический анализ, есть немаленькая вероятность, " +
              "что специалисты узнают, что установлен Партизанский Телеграм.\n\n" +
              "Для продолжения нажмите на кнопку ниже.",
        'be': "Вітаем!\n" +
              "Гэты бот дапаможа вам наладзіць уласную версію Партызанскага Тэлеграма:\n" +
              "1. Выбраць стартавы экран для ўводу код блакіроўкі з маскіроўкай пад розныя дадаткі.\n" +
              "2. Задаць іконку і назву з маскіроўкай пад розныя дадаткі.\n" +
              "3. Выбраць іншыя неабходныя параметры.\n\n" +
              "Дзякуючы гэтаму пры праверцы вашага тэлефона сілавікам і супрацоўнікам спецслужбаў будзе значна складаней даведацца,"
              "што вы карыстаецеся Партызанскім Тэлеграмам, бо мэсэнджэр вонкава будзе падобны на іншы дадатак па вашаму выбару.\n" +
              "<b>АЛЕ!</b> Калі тэлефон забяруць на дэталёвы крыміналістычны аналіз, ёсць немаленькая верагоднасць,"
              "што спецыялісты даведаюцца, што усталяваны Партызанскі Тэлеграм.\n\n" +
              "Для працягу націсніце на кнопку ніжэй.",
        'uk': "Здрастуйте!\n" +
              "Цей бот допоможе вам налаштувати власну версію Партизанського Телеграма:\n" +
              "1. Вибрати стартовий екран для введення коду блокування з маскуванням під різні додатки.\n" +
              "2. Задати іконку та назву з маскуванням під різні додатки.\n" +
              "3. Вибрати інші необхідні параметри.\n\n" +
              "Завдяки цьому під час перевірки вашого телефону силовикам та співробітникам спецслужб буде значно складніше дізнатися," +
              "що ви користуєтеся Партизанським Телеграмом, тому що месенджер зовні буде схожий на інший додаток на ваш вибір.\n" +
              "<b>АЛЕ!</b> Якщо телефон заберуть на детальний криміналістичний аналіз, є немаленька ймовірність," +
              "що фахівці дізнаються, що встановлений Партизанський Телеграм.\n\n" +
              "Для продовження натисніть кнопку нижче.",
    },
    'ask-for-app-name': {
        'en': "Write the name of the application. For good application masking, the name should match the passcode entry screen and the icon. " +
              "For example, if you selected \"Calculator\" passcode entry screen, then the name should be somehow related to the calculator. " +
              "If you selected the icon of some game as the application icon, then the app name should be the same as that game name.\n\n"+
              "The app name can be any length, but preferably <b>no longer than 12 characters</b>.",
        'ru': "Напишите название приложения. Для хорошей маскировки приложения название должно сочетаться с экраном ввода код-пароля и иконкой. " +
              "Например, если Вы выбрали экран ввода код-пароля \"Calculator\", то название должно быть как-то связано с калькулятором. " +
              "Если Вы выбрали иконку какой-нибудь игры в качестве иконки приложения, то название стоит написать такое же, как у этой игры.\n\n" +
              "Название приложения может быть любой длины, но желательно <b>не более 12 символов</b>.",
        'be': "Напішыце назву дадатка. Для добрай маскіроўкі дадатка назва павінна спалучацца з экранам уводу кода блакіроўкі і іконкай. " +
              "Напрыклад, калі Вы выбралі экран уводу кода блакіроўкі \"Calculator\", то назва павінна быць неяк звязана з калькулятарам. " +
              "Калі Вы выбралі іконку якой-небудзь гульні ў якасці абразка дадатка, то назву варта напісаць такую ж, як у гэтай гульні.\n\n" +
              "Назва дадатка можа быць любой даўжыні, але пажадана <b>не больш за 12 сімвалаў</b>.",
        'uk': "Напишіть назву додатку. Для хорошого маскування додатку назва має поєднуватися з екраном введення коду блокування та іконкою. " +
              "Наприклад, якщо Ви вибрали екран введення коду блокування \"Calculator\", то назва має бути якось пов'язана з калькулятором. " +
              "Якщо Ви обрали іконку якоїсь гри в якості іконки додатку, то назву варто написати таку ж, як у цієї гри.\n\n"+
              "Назва додатку може бути будь-якої довжини, але бажано <b>не більше 12 символів</b>.",
    },
    'status-configuring': {
        'en': "You are setting up your Partisan Telegram.",
        'ru': "Вы настраиваете Ваш Партизанский Телеграм.",
        'be': "Вы настройваеце Ваш Партызанскі Тэлеграм.",
        'uk': "Ви налаштовуєте Ваш Партизанський Телеграм.",
    },
    'status-building': {
        'en': "Your Partisan Telegram is building.",
        'ru': "Ваш Партизанский Телеграм собирается.",
        'be': "Ваш Партызанскі Тэлеграм збіраецца.",
        'uk': "Ваш Партизанський Телеграм збирається.",
    },
    'status-queued': {
        'en': "Your Partisan Telegram is in the queue. Your position in the queue: {}",
        'ru': "Ваш Партизанский Телеграм находится в очереди. Ваша позиция в очереди: {}",
        'be': "Ваш Партызанскі Тэлеграм знаходзіцца ў чарзе. Ваша пазіцыя ў чарзе: {}",
        'uk': "Ваш Партизанський Телеграм перебуває у черзі. Ваша позиція у черзі: {}",
    },
    'status-finished': {
        'en': "The build of your Partisan Telegram is finished.",
        'ru': "Сборка Вашего Партизанского Телеграма завершена.",
        'be': "Зборка Вашага Партызанскага Тэлеграма завершана.",
        'uk': "Складання Вашого Партизанського Телеграма завершено.",
    },
    'status-getting-sources-code': {
        'en': "The source code of your application is being prepared.",
        'ru': "Исходный код Вашего приложения подготавливается.",
        'be': "Зыходны код Вашага дадатка падрыхтоўваецца.",
        'uk': "Вихідний код вашого додатку готується..",
    },
    'status-unknown': {
        'en': "Status unknown.",
        'ru': "Статус неизвестен.",
        'be': "Статус невядомы.",
        'uk': "Статус невідомий.",
    },
    'status-desc': {
        'en': "Display your order status",
        'ru': "Показать статус вашего заказа",
        'be': "Паказаць статус вашай замовы",
        'uk': "Показати статус вашого замовлення"
    },
    'start-desc': {
        'en': "Start Configuration",
        'ru': "Начать настройку",
        'be': "Пачаць наладжваць",
        'uk': "Почати налаштування",
    },
    'cancel-desc': {
        'en': "Cancel order",
        'ru': "Отменить заказ",
        'be': "Скасаваць замову",
        'uk': "Скасувати замовлення",
    },
    'suggest-cancel': {
        'en': "If you wish to change your order, please send /cancel.",
        'ru': "Если Вы желаете изменить заказ, пожалуйста, отправьте /cancel.",
        'be': "Калі Вы жадаеце змяніць замову, калі ласка, дашліце /cancel.",
        'uk': "Якщо Ви бажаєте змінити замовлення, будь ласка, відправте /cancel.",
    },
    'cannot-cancel': {
        'en': "Sorry, cannot cancel the build in progress. Please wait until the build completes",
        'ru': "Извините, не могу отменить заказ во время сборки. Пожалуйста, дождитесь завершения сборки.",
        'be': "Выбачайце, не магу скасаваць замову падчас зборкі. Калі ласка, дачакайцеся заканчэння зборкі.",
        'uk': "Вибачте, не можу скасувати замовлення підчас збірки. Будь ласка, дочекайтеся закінчення збірки."
    },
    'cannot-create': {
        'en': "Sorry, cannot accept a new order during the build of the current order. Please wait until the build completes.",
        'ru': "Извините, не могу принять новый заказ во время сборки текущего заказа. Пожалуйста, дождитесь завершения сборки.",
        'be': "Выбачайце, не магу прыняць новую замову падчас зборкі бягучай замовы. Калі ласка, дачакайцеся заканчэння зборкі.",
        'uk': "Вибачте, не можу прийняти нове замовлення під час збірки поточного замовлення. Будь ласка, дочекайтеся закінчення збірки."
    },
    'media-files-are-not-allowed': {
        'en': "At this stage media files are not allowed.",
        'ru': "На этом этапе медиафайлы не разрешены.",
        'be': "На гэтым этапе медыяфайлы не дазволены.",
        'uk': "На цьому етапі медіафайли не дозволені."
    },
    'suggest-start': {
        'en': "Please send /start to start setting up your version of Partisan Telegram.",
        'ru': "Пожалуйста, отправьте /start для начала настройки Вашей версии Партизанского Телеграма.",
        'be': "Калі ласка, дашліце /start для пачатку наладкі Вашай версіі Партызанскага Тэлеграма.",
        'uk': "Будь ласка, надішліть /start для початку налаштування Вашої версії Партизанського Телеграма.",
    },
    'unknown-text-response': {
        'en': "Text is not allowed at this step.",
        'ru': "На этом этапе текст не разрешён.",
        'be': "На гэтым этапе тэкст не дазволены.",
        'uk': "На цьому етапі текст не дозволено.",
    },
    'build-ended': {
        'en': "Your Partisan Telegram has been built. Install the apk file from the post above.\n\n" +
              "If you want to check the source code of the application, click the \"{}\" button.\n\n" +
              "PAY ATTENTION! This version of the Partisan Telegram is updated only in the way that is described on <a href='https://t.me/cpartisans_security/761'>the channel</a>. " +
              "If you run the bot again and set up all the parameters, as the previous time, this will not allow you to update the current application. " +
              "In this way, you can only get a new application that cannot be installed on the phone in parallel with the current one.",
        'ru': "Ваш Партизанский Телеграм собран. Установите файл с расширением apk из сообщения выше.\n\n" +
              "Если Вы хотите проверить исходный код приложения, нажмите кнопку \"{}\".\n\n" +
              "ОБРАТИТЕ ВНИМАНИЕ! Такая версия Партизанского Телеграма обновляется только тем способом, который описан на <a href='https://t.me/cpartisans_security/761'>канале</a>. " +
              "Если вы запустите бот снова и настроите все параметры, как в предыдущий раз, это не позволит вам обновить текущее приложение. " +
              "Таким способом вы можете получить только новое приложение, которое не удастся установить на телефон параллельно с текущим.",
        'be': "Ваш Партызанскі Тэлеграм сабраны. Усталюйце файл з пашырэннем apk з паведамлення вышэй.\n\n" +
              "Калі Вы жадаеце праверыць зыходны код дадатка, націсніце кнопку \"{}\".\n\n" +
              "Звярніце ўвагу! Гэтая версія Партызанскага Тэлеграма абнаўляецца толькі тым спосабам, як апісаны на <a href='https://t.me/cpartisans_security/761'>канале</a>. " +
              "Калі вы зноў запусціце бота і ўсталюйце ўсе параметры, як у папярэдні раз, гэта не дазволіць вам абнавіць бягучы дадатак. " +
              "Такім чынам, вы можаце атрымаць толькі новы дадатак, якое не можа быць усталявана па тэлефоне паралельна з бягучым.",
        'uk': "Ваш Партизанський Телеграм зібрано. Встановіть файл із розширенням apk із повідомлення вище.\n\n" +
              "Якщо Ви бажаєте перевірити вихідний код додатку, натисніть кнопку \"{}\".\n\n" +
              "ЗВЕРНІТЬ УВАГУ! Така версія Партизанського Телеграма оновлюється лише тим способом, який описаний на <a href='https://t.me/cpartisans_security/761'>каналі</a>. " +
              "Якщо ви запустите бот знову і налаштуєте всі параметри, як у попередній раз, це не дозволить вам оновити поточний додаток. " +
              "Таким чином ви можете отримати тільки новий додаток, яку не вдасться встановити на телефон паралельно з поточним.",
    },
    'chat-will-be-deleted-automatically': {
        'en': "Correspondence with the bot will be deleted automatically after {0:.0f} minutes. "
              "If you want to delete the conversation right now, click \"{1}\".",
        'ru': "Переписка с ботом удалится автоматически через {0:.0f} минут. " +
              "Если Вы хотите удалить переписку прямо сейчас, нажмите \"{1}\".",
        'be': "Перапіска з ботам выдаліцца аўтаматычна праз {0:.0f} хвілін. "
              "Калі Вы жадаеце выдаліць перапіску прама зараз, націсніце \"{1}\".",
        'uk': "Листування з ботом буде видалено автоматично через {0:.0f} хвилин. "
              "Якщо Ви бажаєте видалити листування прямо зараз, натисніть \"{1}\".",
    },
    'get-sources-queued': {
        'en': "Request sent. Please wait for the source code file.",
        'ru': "Запрос отправлен. Ожидайте файл с исходным кодом.",
        'be': "Запыт адпраўлены. Чакайце файл з зыходным кодам.",
        'uk': "Запыт адпраўлены. Чакайце файл з зыходным кодам.",
    },
    'sources-sent': {
        'en': "The file above contains the source code of your application. " +
              "To ensure that the installation file matches this source code, use this instruction: https://core.telegram.org/reproducible-builds.",
        'ru': "Файл выше содержит исходный код Вашего приложения. " +
              "Чтобы убедиться, что установочный файл соответствует этому исходному коду, воспользуйтесь этой инструкцией: https://core.telegram.org/reproducible-builds.",
        'be': "Файл вышэй змяшчае зыходны код Вашага дадатка. " +
              "Каб пераканацца, што ўсталявальны файл адпавядае гэтаму зыходнаму коду, скарыстайце гэтую інструкцыю: https://core.telegram.org/reproducible-builds.",
        'uk': "Файл вище містить вихідний код вашої додатку. " +
              "Ўоб переконатися, що файл інсталяції відповідає цьому вихідному коду, скористайтеся цією інструкцією: https://core.telegram.org/reproducible-builds.",
    },
    'clear-bot': {
        'en': "❌ Clear messages",
        'ru': "❌ Очистить переписку",
        'be': "❌ Ачысціць перапіску",
        'uk': "❌ Очистити листування",
    },
    'request-confirmation-again': {
        'en': "Please click one of the buttons above.",
        'ru': "Пожалуйста, нажмите на одну из кнопок выше.",
        'be': "Калі ласка, націсніце на адну з кнопак.",
        'uk': "Будь ласка, натисніть одну з кнопок вище.",
    },
    'ask-for-masked-passcode-screen': {
        'en': "Select the screen that will appear when you open the application. " +
              "On this screen, you will need to enter a passcode to enter Partisan Telegram. Select one of the available options:.\n\n" +
              "{}\n\n" +
              "After selecting the passcode input screen, the bot will select a random icon, name and other settings for the app. " +
              "You can agree with these random settings or customize the app to your choice.",
        'ru': "Выберите экран, который будет появляться, когда открываете приложение. " +
              "На этом экране вам нужно будет вводить код-пароль, чтобы войти в Партизанский Телеграм. " +
              "Выберите один из доступных вариантов:\n\n" +
              "{}\n\n" +
              "После выбора экрана ввода код-пароля бот выберет случайные иконку, название и прочие настройки для приложения. " +
              "Вы можете согласиться с этими настройками или детально настроить приложение по своему выбору.",
        'be': "Выбярыце экран, які будзе з'яўляцца, калі адкрываеце праграму. " +
              "На гэтым экране вам трэба будзе ўводзіць код блакіроўкі, каб увайсці ў Партызанскі Тэлеграм. " +
              "Абярыце адзін з даступных варыянтаў:.\n\n" +
              "{}\n\n" +
              "Пасля выбару экрана ўводу кода блакіроўкі бот выбера выпадковыя ікноку, назву і іншыя налады для дадатка. " +
              "Вы можаце пагадзіцца з гэтымі выпадковымі наладамі або дэталёва наладзіць дадатак па свайму выбару.",
        'uk': "Виберіть екран, який з'явиться, коли відкриваєте додаток. " +
              "На цьому екрані вам потрібно буде вводити пароль, щоб увійти в Партизанський Телеграм. " +
              "Виберіть один із доступних варіантів:\n\n" +
              "{}\n\n" +
              "Після вибору екрана введення коду блокування бот вибере випадкові іконку, назву та інші налаштування для додатку. " +
              "Ви можете погодитися з цими випадковими налаштуваннями або детально налаштувати додаток на свій вибір.",
    },
    'calculator-screen-description': {
        'en': "<b>Calculator</b> - the passcode entry screen is masked as a calculator. " +
              "You will need to enter a passcode here to unlock the application.\n" +
              "<i>Pros</i>: Intuitive passcode entry.\n" +
              "<i>Cons</i>: The calculator masking may be too obvious; only numeric passcodes are available.",
        'ru': "<b>Calculator</b> - экран ввода код-пароля маскируется под калькулятор. " +
              "В нём нужно будет ввести код-пароль, чтобы приложение разблокировалось.\n" +
              "<i>Плюсы</i>: интуитивно понятный ввод код-пароля.\n" +
              "<i>Минусы</i>: маскировка под калькулятор может быть слишком очевидной; доступны только цифровые код-пароли.",
        'be': "<b>Calculator</b> - экран уводу кода блакіроўкі маскіруецца пад калькулятар. " +
              "У ім трэба будзе ўвесці код блакіроўкі, каб дадатак разблакаваўся.\n" +
              "<i>Плюсы</i>: інтуітыўна зразумелы ўвод кода блакіроўкі.\n" +
              "<i>Мінусы</i>: маскіроўка пад калькулятар можа быць занадта відавочнай; даступныя толькі лічбавыя кады блакіроўкі.",
        'uk': "<b>Calculator</b> - екран введення коду блокування маскується під калькулятор. " +
              "У ньому потрібно буде ввести код блокування, щоб додаток розблокувалася.\n" +
              "<i>Плюси</i>: інтуїтивно зрозуміле введення коду блокування.\n" +
              "<i>Мінус</i>: маскування під калькулятор може бути занадто очевидним; доступні тільки цифрові коди блокування.",
    },
    'note-screen-description': {
        'en': "<b>Note</b> - the passcode entry screen is masked as a note application. " +
              "In it, you will need to create a note with the passcode in the title to unlock the application.\n" +
              "<i>Pros</i>: You can use not only digital passcodes, but also alphanumeric passwords of any length.",
        'ru': "<b>Note</b> - экран ввода код-пароля маскируется под приложение для записок. " +
              "В нём нужно будет создать заметку, в тексте названия которой будет код-пароль, чтобы разблокировать приложение.\n" +
              "<i>Плюсы</i>: можно использовать не только цифровые коды, но и буквенно-цифровые пароли произвольной длины.",
        'be': "<b>Note</b> - экран уводу кода блакіроўкі маскіруецца пад дадатак для запісак. " +
              "У ім трэба будзе стварыць нататку, у тэксце назвы якой будзе код блакіроўкі, каб разблакаваць дадатак.\n" +
              "<i>Плюсы</i>: можна выкарыстоўваць не толькі лічбавыя коды, але і літарна-лічбавыя паролі адвольнай даўжыні.",
        'uk': "<b>Note</b> - екран введення коду блокування маскується під додаток для записок. " +
              "У ньому потрібно буде створити замітку, в тексті назви якої буде код блокування, щоб розблокувати прліоження.\n" +
              "<i>Плюси</i>: можна використовувати не лише цифрові коди блокування, а й буквено-цифрові паролі довільної довжини.",
    },
    'loading-screen-description': {
        'en': "<b>Loading</b> - the passcode entry screen is masked as a loading screen. " +
              "To unlock Partisan Telegram, you need to click on different parts of the screen that correspond to the location of the numbers in the given passcode on the numeric keypad. " +
              "You must remember where the corresponding buttons are located, the numeric keypad is NOT displayed on the passcode entry screen. " +
              "Don't worry, we will show you how to use such a lock screen in the tutorial video.\n"
              "You will need to tap on different parts of the screen here to enter a passcode.\n" +
              "<i>Pros</i>: Compatible with masking for a wide variety of applications. The loading screen will look logical with different names and icons.\n" +
              "<i>Cons</i>: It can be difficult to figure out, how to enter a passcode; only numeric passcodes are available.",
        'ru': "<b>Loading</b> - экран ввода код-пароля маскируется под экран загрузки. " +
              "Для разблокировки Партизанского Телеграма нужно нажимать на разные части экрана, которые соответствуют расположению цифр в заданном код-пароле на цифровой клавиатуре. " +
              "Вы должны помнить, где располагаются соответствующие кнопки, цифровая клавиатура на экране ввода код-пароля НЕ отображается. " +
              "Не волнуйтесь, в обучающем видео мы покажем, как пользоваться таким экраном блокировки.\n" +
              "<i>Плюсы</i>: Совместимо с маскировкой под очень разные приложения. Экран загрузки будет логично выглядеть с разными названиями и иконками.\n" +
              "<i>Минусы</i>: может быть сложно разобраться, как вводить код-пароль; доступны только цифровые код-пароли.",
        'be': "<b>Loading</b> - экран уводу кода блакіроўкі маскіруецца пад экран загрузкі. " +
              "Для разблакіроўкі Партызанскага Тэлеграма трэба націскаць на розныя часткі экрана, якія адпавядаюць размяшчэнню лічбаў у зададзеным кодзе блакіроўкі на лічбавай клавіятуры. " +
              "Вы павінны памятаць, дзе размяшчаюцца адпаведныя кнопкі, лічбавая клавіятура на экране ўводу кода блакіроўкі НЕ адлюстроўваецца. " +
              "Не хвалюйцеся, ў навучальным відэа мы пакажам, як карыстацца такім экранам блакіроўкі." +
              "У ім трэба будзе націскаць на розныя часткі экрана, каб увесці код блакіроўкі.\n" +
              "<i>Плюсы</i>: можна маскіравацца пад вельмі розныя дадаткі. Экран загрузкі будзе лагічна выглядаць з рознымі назвамі і іконкамі.\n" +
              "<i>Мінусы</i>: можа быць складана разабрацца, як уводзіць код блакіроўкі; даступныя толькі лічбавыя кады блакіроўкі.",
        'uk': "<b>Loading</b> - екран введення коду блокування маскується під екран завантаження. " +
              "Для розблокування Партизанського Телеграма потрібно натискати на різні частини екрана, які відповідають розташуванню цифр у заданому коду блокування на цифровій клавіатурі. " +
              "Ви повинні пам'ятати, де розташовуються відповідні кнопки, цифрова клавіатура на екрані введення коду блокування НЕ відображається. " +
              "Не хвилюйтесь, в навчальному відео ми покажемо, як користуватись таким екраном блокування." +
              "У ньому потрібно буде натискати на різні частини екрана, щоб ввести код блокування.\n" +
              "<i>Плюси</i>: Сумісно з маскуванням під дуже різні додаткі. Екран завантаження буде логічно виглядати з різними назвами та іконками.\n" +
              "<i>Мінус</i>: може бути складно розібратися, як вводити код блокування; доступні тільки цифрові коди блокування.",
    },
    'advanced-masked-passcode-screens-description': {
        'en': "You can configure the app with a more advanced masked screen. " +
              "These screens may be better at masking themselves as different apps, but they may be harder to figure out how to enter your passcode. " +
              "If you want to see these screens, click the {} button.",
        'ru': "Вы можете настроить приложение и с более продвинутым замаскированным экраном. " +
              "У таких экранов может быть лучше маскировка под разные приложения, но будет сложнее разобраться, как вводить код-пароль. " +
              "Если хотите ознакомиться с такими экранами, нажмите кнопку {}.",
        'be': "Вы можаце наладзіць дадатак і з больш прасунутым экранам. " +
              "У такіх экранаў можа быць лепш маскіроўка пад розныя дадаткі, але будзе складаней разабрацца, як уводзіць код блакіроўкі. " +
              "Калі хочаце азнаёміцца з такімі экранамі, націсніце кнопку {}.",
        'uk': "Ви можете налаштувати додаток і з більш просунутим екраном. " +
              "У таких екранів може бути краще маскування під різні додатки, але буде складніше розібратися, як вводити код блокування. " +
              "Якщо хочете ознайомитися з такими екранами, натисніть кнопку {}.",
    },
    'ask-for-notification-color': {
        'en': "Choose the primary color of the app.\n\n"
              "The primary color allows you to make the appearance of your version of the masked application original. " +
              "This will make it harder to compare it with other Partisan Telegrams with similar screens for entering a passcode that other users set up for themselves." +
              "For example, this color will be used as the color of the notification icon and the color of the passcode entry screen buttons.\n\n" +
              "A good choice would be to use the system color. In this case, the colors in the app will match the Android system colors.\n\n" +
              "If you choose a color other than the system color, it is a good idea to choose a color that matches the colors of the app icon.",
        'ru': "Выберите основной цвет приложения.\n\n"
              "Основной цвет позволяет сделать внешний вид Вашей версии замаскированного приложения оригинальным. " +
              "Так его сложнее будет сопоставить с другими Партизанскими Телеграмами со схожеми экранами для ввода код-пароля, которые устанавливают себе другие пользователи. " +
              "Этот цвет, например, будет использоваться в качестве цвета иконки уведомлений и цвета кнопок экрана ввода код-пароля.\n\n" +
              "Неплохим выбором будет использовать системный цвет. В этом случае цвета в приложении будут совпадать с системными цветами Android.\n\n" +
              "Если Вы выбираете цвет, отличный от системного, хорошей идеей будет выбрать цвет, который сочетается с цветами иконки приложения.",
        'be': "Абярыце асноўны колер дадатка.\n\n"
              "Асноўны колер дазваляе зрабіць вонкавы выгляд Вашай версіі замаскіраванага дадатка арыгінальным. " +
              "Так яго складаней будзе супаставіць з іншымі Партызанскімі Тэлеграмамі са падобнымі экранамі для ўводу коду блакіроўкі, якія ўсталёўваюць сабе іншыя карыстальнікі." +
              "Гэты колер, напрыклад, будзе выкарыстоўвацца ў якасці колеру іконкі апавяшчэнняў і колеры кнопак экрана ўводу кода блакіроўкі.\n\n" +
              "Нядрэнным выбарам будзе выкарыстоўваць сістэмны колер. У гэтым выпадку колеры ў дадатку будуць супадаць з сістэмнымі колерамі Android.\n\n" +
              "Калі Вы выбіраеце колер, які адрозніваецца ад сістэмнага, добрай ідэяй будзе выбраць колер, які спалучаецца з колерамі іконкаў дадатку.",
        'uk': "Виберіть основний колір додатку.\n\n"
              "Основний колір дозволяє зробити зовнішній вигляд Вашої версії замаскованої додатку оригінальним. " +
              "Так його складніше буде зіставити з іншими Партизанськими Телеграмами зі схожими екранами для введення коду блокування, які встановлюють собі інші користувачі." +
              "Цей колір, наприклад, буде використовуватися як колір іконки сповіщень та кольору кнопок екрана введення коду блокування.\n\n" +
              "Непоганим вибором буде використовувати системний колір. У цьому випадку кольори в додатку збігатимуться з системними кольорами Android.\n\n" +
              "Якщо Ви вибираєте колір, відмінний від системного, гарною ідеєю буде вибрати колір, який поєднується з кольорами іконки додатку.",
    },
    'ask-for-version-name': {
        'en': "Enter the app version name.\n\n"
              "You can usually see the app version name in the app settings. "
              "The version name usually consists of several numbers separated by periods. For example, 1.2.3 or 10.17.6d. " +
              "If you are masking Partisan Telegram as some existing application, it makes sense to make the version name the same as that application.",
        'ru': "Введите название версии приложения.\n\n"
              "Название версии отображается в настройках приложения и обычно состоит из нескольких чисел, разделённых точками. Например, 1.2.3 или 10.17.6d. " +
              "Если Вы маскируете Партизанский Телеграм под какое-то существующее приложение, имеет смысл сделать название версии такое же, как у этого приложения.",
        'be': "Увядзіце назву версіі дадатка.\n\n"
              "Назва версіі адлюстроўваецца ў наладах дадатку і звычайна складаецца з некалькіх лікаў, падзеленых кропкамі. Напрыклад, 1.2.3 або 10.17.6d." +
              "Калі Вы маскіруецеся пад нейкі існуючы дадатак, мае сэнс зрабіць назву версіі такую ж, як у гэтага дадатка.",
        'uk': "Введіть назву версії додатку.\n\n"
              "Назва версії відображається в налаштуваннях додатку і зазвичай складається з кількох чисел, розділених точками. Наприклад, 1.2.3 або 10.17.6d. "
              "Якщо Ви маскуєте Партизанський Телеграм під якийсь існуючий додаток, має сенс зробити назву версії таку ж, як у цієї додатки.",
    },
    'ask-for-version-code': {
        'en': "Enter the app version code.\n\n" +
              "<b>The app version code is NOT the same as the app version name!</b> " +
              "The app version code is an integer, without dots or other symbols. For example, 123 or 42. " +
              "The application version code is often not visible in the application settings, but it can be viewed using special programs for software analysis." +
              "We recommend leaving the version code that our bot has randomly selected. But you can enter a different number at your discretion. " +
              "When updating a masked app, the version code will automatically increase.",
        'ru': "Введите код версии приложения.\n\n" +
              "<b>Код версии приложения НЕ то же самое, что название версии приложения!</b> " +
              "Код версии приложения - это целое число, без точек и других символов. Например, 123 или 42. " +
              "Код версии приложения часто нельзя увидеть в настройках приложения, но его можно посмотреть при помощи специальных программ для анализа софта. " +
              "Мы рекомендуем оставить тот код версии, который наш бот выбрал случайным образом. Но по своему усмотрению вы можете ввести другое число. " +
              "При обновлениях замаскированного приложения, код версии будет автоматически увеличиваться.",
        'be': "Увядзіце код версіі дадатка.\n\n" +
              "<b>Код версіі дадатка НЕ тое ж самае, што назва версіі дадатка!</b> " +
              "Код версіі дадатка часта нельга ўбачыць у наладах дадатка, але яго можна паглядзець пры дапамозе спецыяльных праграм для аналізу софту. " +
              "Мы рэкамендуем пакінуць той код версіі, які наш бот абраў выпадковым чынам. Але па сваім меркаванні вы можаце ўвесці іншы лік. " +
              "Код версіі дадатка часта нельга ўбачыць у наладах дадатка, але яго можна паглядзець пры дапамозе іншых дадаткаў. " +
              "Пры абнаўленнях замаскіраванага дадатка код версіі будзе аўтаматычна павялічвацца.",
        'uk': "Введіть код версії додатку.\n\n" +
              "<b>Код версії додатку НЕ те саме, що назва версії додатку!</b> " +
              "Код версії додатку часто не можна побачити в налаштуваннях додатку, але його можна подивитися за допомогою спеціальних програм для аналізу софту." +
              "Ми рекомендуємо залишити той код версії, який наш бот вибрав випадковим чином. Але на свій розсуд ви можете ввести інше число." +
              "Код версії додатку часто не можна побачити в налаштуваннях додатку, але його можна подивитися за допомогою інших додатків. " +
              "При оновленні замаскованого додатка код версії буде автоматично збільшуватися.",
    },
    'version-code-must-be-integer': {
        'en': "The code must be an <b>integer</b> number greater than 0 and no greater than {}.",
        'ru': "Код должен быть <b>целым</b> числом больше 0 и не более {}.",
        'be': "Код павінен быць <b>цэлым</b> лікам больш за 0 і не больш за {}.",
        'uk': "Код повинен бути <b>цілим</b> числом більше 0 і не більше {}.",
    },
    'ask-for-notification-text': {
        'en': "Enter the text of the notification that will be displayed instead of Telegram notifications. " +
              "You will see this text every time you receive messages in the app. " +
              "The text of the notification should be realistic, match the rest of the app settings and not attract unnecessary attention. " +
              "You can write something universal, suitable for any app. For example, \"Update available!\".\n\n" +
              "If you do not plan to enable notifications in the app, you can simply skip this step.",
        'ru': "Введите текст уведомления, которое будет отображаться вместо уведомлений Телеграма. " +
              "Вы будете видеть этот текст каждый раз, когда получаете сообщения в приложении. " +
              "Текст уведомления должен быть реалистичным, сочетаться с остальными настройками приложения и не привлекать лишнего внимания. " +
              "Вы можете написать что-нибудь универсальное, подходящее любому приложению. Например, \"Доступно обновление!\".\n\n" +
              "Если вы не планируете включать уведомления в приложении, можете просто пропустить этот шаг.",
        'be': "Увядзіце тэкст апавяшчэння, якое будзе адлюстроўвацца замест апавяшчэнняў Тэлеграма. " +
              "Вы будзеце бачыць гэты тэкст кожны раз, калі атрымліваеце паведамленні ў дадатку. " +
              "Тэкст апавяшчэння павінен быць рэалістычным, спалучацца з астатнімі наладамі дадатка і не прыцягваць лішняй увагі. " +
              "Вы можаце напісаць што-небудзь універсальнае, якое падыходзіць любому з дадаткам. Напрыклад, \"Даступна абнаўленне!\".\n\n" +
              "Калі вы не плануеце ўключаць апавяшчэння ў дадатку, можаце проста прапусціць гэты крок.",
        'uk': "Введіть текст повідомлення, яке буде відображатися замість повідомлень Телеграма. " +
              "Ви будете бачити цей текст щоразу, коли отримуватимете повідомлення в додатку. " +
              "Текст повідомлення повинен бути реалістичним, поєднуватися з іншими налаштуваннями додатку та не привертати зайвої уваги. "
              "Ви можете написати щось універсальне, що підходить будь-якому додатку. Наприклад, \"Доступно оновлення!\".\n\n" +
              "Якщо ви не плануєте вмикати повідомлення в додатку, можете просто пропустити цей крок.",
    },
    'ask-for-notification-icon': {
        'en': "Please upload a notification icon as an uncompressed file.\n\n" +
              "The notification icon must be a square image with a <b>transparent (non-white) background</b>. " +
              "If you upload a regular image without transparent background, the icon will appear as a square of a certain color.\n\n" +
              "The image above shows roughly what the current icon will look like. " +
              "If you want to keep it, click the button below this message.",
        'ru': "Пожалуйста, загрузите иконку для уведомлений в виде несжатого файла.\n\n" +
              "Иконка для уведомлений должна быть квадратным изображением с <b>прозрачным (не белым) фоном</b>. " +
              "Если вы загрузите обычное изображение без прозрачного фона, иконка будет выглядеть как квадрат определённого цвета.\n\n" +
              "На изображении выше Вы можете увидеть, как примерно будет выглядеть текущая иконка. " +
              "Если Вы хотите её оставить, нажмите на кнопку под этим сообщением.",
        'be': "Калі ласка, загрузіце іконку для апавяшчэнняў у выглядзе несціснутага файла.\n\n" +
              "Іконка для апавяшчэнняў павінна быць квадратнай выявай з <b>празрыстым (не белым) фонам</b>. " +
              "Калі вы загрузіце звычайны малюнак без празрыстага фону, іконка будзе выглядаць як квадрат пэўнага колеру.\n\n" +
              "На малюнку вышэй Вы можаце ўбачыць, як прыкладна будзе выглядаць бягучая іконка. " +
              "Калі Вы жадаеце яе пакінуць, націсніце на кнопку пад гэтым паведамленнем.",
        'uk': "Будь ласка, завантажте іконку для сповіщень у вигляді несжатого файлу.\n\n" +
              "Іконка для сповіщень має бути квадратним зображенням з <b>прозорим (не білим) тлом</b>. " +
              "Якщо ви завантажите звичайне зображення без прозорого фону, іконка буде виглядати як квадрат певного кольору.\n\n" +
              "На зображенні вище Ви можете побачити, як буде виглядати поточна іконка. " +
              "Якщо Ви хочете залишити її, натисніть кнопку під цим повідомленням.",
    },
    'notification-icon-must-be-uncompressed': {
        'en': "Please upload a notification icon as an <b>uncompressed</b> file.",
        'ru': "Пожалуйста, загрузите иконку для уведомлений в виде <b>несжатого</b> файла.",
        'be': "Калі ласка, загрузіце іконку для апавяшчэнняў у выглядзе <b>несціснутага</b> файла.",
        'uk': "Будь ласка, завантажте іконку для сповіщень у вигляді <b>несжатого</b> файлу.",
    },
    'notification-icon-must-be-transparent': {
        'en': "The icon must have a transparent background. An example of such an icon is in the file above.",
        'ru': "Иконка должна быть с прозрачным фоном. Пример такой иконки в файле выше.",
        'be': "Іконка павінна быць з празрыстым фонам. Прыклад такой іконкі ў файле вышэй.",
        'uk': "Іконка має бути з прозорим фоном. Приклад такої іконки у файлі вищий.",
    },
    'ask-for-permissions': {
        'en': "Select the permissions that will be available to the app.\n\n" +
              "Permissions determine which phone functions the app can access. " +
              "You can find the app's permissions in its settings. " +
              "If you disable any permissions at this step, they will disappear from the Partisan Telegram system settings and cannot be enabled. " +
              "The fewer permissions you select, the less suspicious the app will potentially be. " +
              "For example, it may be suspicious that a calculator has access to photos and videos.\n\n" +
              "On the other hand, the fewer permissions you select, the more difficult it is to use the app. " +
              "For example, if you disable access to photos and videos, you will not be able to send photos to chats. " +
              "Also, reducing the available permissions may cause the app to not work correctly.\n\n" +
              "By default, the most commonly used permissions are already enabled. " +
              "They allow you to receive notifications, take and send photos, make calls and record voice messages, send and broadcast geolocation. " +
              "You can add or remove permissions using the buttons below.\n\n" +
              "Please note that if it turns out that the app is inconvenient to use with the selected permissions, you will have to rebuild it.",
        'ru': "Выберите разрешения, которые будут доступны для приложения.\n\n" +
              "Разрешения определяют, к каким функциям телефона сможет получить доступ приложение. " +
              "Разрешения приложения можно найти в его настройках. " +
              "Если вы отключите какие-то разрешения на этом шаге, они пропадут из списка системных настроек Партизанского Телеграма и их нельзя будет включить. " +
              "Чем меньше разрешений будет выбрано, тем, потенциально, меньше подозрений приложение будет вызывать. " +
              "Например, может быть подозрительно, что калькулятор имеет доступ к фото и видео.\n\n" +
              "С другой стороны, чем меньше разрешений выбрано, тем сложнее пользоваться приложением. " +
              "Например, если отключить доступ к фото и видео, Вы не сможете отправлять фото в чаты. " +
              "Кроме того, уменьшение доступных разрешений может привести к некорректной работе приложения.\n\n" +
              "По умолчанию наиболее часто используемые разрешения уже включены. " +
              "Они позволяют получать уведомления, делать и отправлять фото, совершать звонки и записывать голосовые сообщения, отправлять и транслировать геолокацию. " +
              "Вы можете добавить или убрать разрешения с помощью кнопок ниже.\n\n\n\n" +
              "Учтите, что если окажется, что приложением с выбранными разрешениями пользоваться неудобно, придётся собирать его заново. ",
        'be': "Абярыце дазволы, якія будуць даступныя для дадатка.\n\n" +
              "Дазволы вызначаюць, да якіх функцый тэлефона зможа атрымаць доступ дадатак."
              "Дазволы дадатка можна знайсці ў яго наладах. " +
              "Калі вы адключыце нейкія дазволы на гэтым кроку, яны знікнуць з спісу сістэмных налад Партызанскага Тэлеграма і іх нельга будзе ўключыць. " +
              "Чым менш дазволаў будзе абрана, тым, патэнцыйна, менш падазрэнняў дадатак будзе выклікаць. " +
              "Напрыклад, можа быць падазрона, што калькулятар мае доступ да фота і відэа.\n\n" +
              "З іншага боку, чым менш дазволаў абрана, тым складаней карыстацца дадаткам. "
              "Напрыклад, калі адключыць доступ да фота і відэа, Вы не зможаце адпраўляць фота ў чаты. "
              "Акрамя таго, памяншэнне даступных дазволаў можа прывесці да некарэктнай працы дадатка.\n\n" +
              "Па змаўчанні найболей часта выкарыстоўваныя дазволы ўжо ўключаныя. " +
              "Яны дазваляюць атрымліваць апавяшчэнні, рабіць і адпраўляць фота, здзяйсняць званкі і запісваць галасавыя паведамленні, адпраўляць і трансляваць геолокацию. " +
              "Вы можаце дадаць або прыбраць дазволы з дапамогай кнопак ніжэй.\n\n" +
              "Улічыце, што калі апынецца, што дадаткам з абранымі дазволамі карыстацца няёмка, прыйдзецца збіраць яго нанова. ",
        'uk': "Виберіть дозволи, які будуть доступні для додатку.\n\n" +
              "Дозволи визначають, до яких функцій телефону зможе отримати доступ додаток. " +
              "Дозволи додатку можна знайти в його налаштуваннях. " +
              "Якщо ви вимкнете якісь дозволи на цьому кроці, вони пропадуть зі списку системних налаштувань Партизанського Телеграма і їх не можна буде увімкнути. " +
              "Чим менше дозволів буде обрано, тим, потенційно, менше підозр додаток буде викликати. " +
              "Наприклад, може бути підозріло, що калькулятор має доступ до фото та відео.\n\n" +
              "З іншого боку, чим менше дозволів вибрано, тим складніше користуватися додатком. " +
              "Наприклад, якщо вимкнути доступ до фото та відео, Ви не зможете надсилати фото в чати. " +
              "Крім того, зменшення доступних дозволів може призвести до некоректної роботи додатку.\n\n" +
              "За замовчуванням найчастіше використовувані дозволи вже включені. " +
              "Вони дозволяють отримувати повідомлення, робити та надсилати фото, здійснювати дзвінки та записувати голосові повідомлення, надсилати та транслювати геолокацію. "
              "Ви можете додати або видалити дозволи за допомогою кнопок нижче.\n\n" +
              "Врахуйте, що якщо виявиться, що додатком з обраними дозволами користуватися незручно, доведеться збирати його заново.",
    },
    'permission-camera': {
        'en': "Camera",
        'ru': "Камера",
        'be': "Камера",
        'uk': "Камера",
    },
    'permission-location': {
        'en': "Location",
        'ru': "Местоположение",
        'be': "Месцазнаходжанне",
        'uk': "Геодані",
    },
    'permission-microphone': {
        'en': "Microphone",
        'ru': "Микрофон",
        'be': "Мікрафон",
        'uk': "Мікрофон",
    },
    'permission-notifications': {
        'en': "Notifications",
        'ru': "Уведомления",
        'be': "Апавяшчэнні",
        'uk': "Сповіщення",
    },
    'permission-photos_and_video': {
        'en': "Photos and video",
        'ru': "Фото и видео",
        'be': "Фота і відэа",
        'uk': "Фото й відео",
    },
    'permission-contacts': {
        'en': "Contacts",
        'ru': "Контакты",
        'be': "Кантакты",
        'uk': "Контакти",
    },
    'permission-music_and_audio': {
        'en': "Music and audio",
        'ru': "Музыка и аудио",
        'be': "Музыка і аўдыя",
        'uk': "Музика й аудіо",
    },
    'permission-call_logs': {
        'en': "Call logs",
        'ru': "Список вызовов",
        'be': "Журналы выклікаў",
        'uk': "Журнали викликів",
    },
    'permission-phone': {
        'en': "Phone",
        'ru': "Телефон",
        'be': "Тэлефон",
        'uk': "Телефон",
    },
    'permission-nearby_devices': {
        'en': "Nearby Devices",
        'ru': "Устройства поблизости",
        'be': "Прылады паблізу",
        'uk': "Пристрої поблизу",
    },
    'permission-sms': {
        'en': "SMS",
        'ru': "SMS",
        'be': "SMS",
        'uk': "SMS",
    },
    'check-all': {
        'en': "Check All",
        'ru': "Выбрать все",
        'be': "Выбраць усе",
        'uk': "Вибрати всі",
    },
    'clear-all': {
        'en': "Clear all",
        'ru': "Очистить все",
        'be': "Ачысціць усе",
        'uk': "Очистити всі",
    },
    'continue': {
        'en': "Continue",
        'ru': "Продолжить",
        'be': "Працягнуць",
        'uk': "Продовжити",
    },
    'start-build': {
        'en': "✅ Start Build",
        'ru': "✅ Начать сборку",
        'be': "✅ Пачаць зборку",
        'uk': "✅ Почати складання",
    },
    'customize-app-name-only': {
        'en': "✏️ Change Name",
        'ru': "✏️ Изменить название",
        'be': "✏️ Змяніць назву",
        'uk': "✏️ Змінити назву",
    },
    'customize-app-icon-only': {
        'en': "🖼 Change Icon",
        'ru': "🖼 Изменить иконку",
        'be': "🖼 Змяніць іконку",
        'uk': "🖼 Змінити іконку",
    },
    'customize-settings': {
        'en': "⚙️ Customize All Settings",
        'ru': "⚙️ Изменить все настройки",
        'be': "⚙️ Змяніць усе налады",
        'uk': "⚙️ Змінити всі налаштування",
    },
    'low-priority': {
        'en': "You have recently built the app, so the build priority will be lower. " +
              "Apps are built first for those who are doing it for the first time.",
        'ru': "Вы недавно уже собирали приложение, поэтому приоритет сборки будет ниже. " +
              "В первую очередь приложения собираются для тех, кто делает это впервые.",
        'be': "Вы нядаўна ўжо збіралі дадатак, таму прыярытэт зборкі будзе ніжэй. " +
              "У першую чаргу дадакі збіраюцца для тых, хто робіць гэта ўпершыню.",
        'uk': "Ви нещодавно вже збирали додаток, тому пріоритет складання буде нижче. " +
              "Насамперед додатки збираються для тих, хто робить це вперше.",
    },
    'start-configuration': {
        'en': "Start Configuration",
        'ru': "Начать настройку",
        'be': "Пачаць наладжваць",
        'uk': "Почати налаштування",
    },
    'start-configuration-again': {
        'en': "⚙️ Start Configuration Again",
        'ru': "⚙️ Начать настройку заново",
        'be': "⚙️ Пачаць наладжваць зноў",
        'uk': "⚙️ Почати налаштування заново",
    },
    'leave-current-value': {
        'en': "✅ Leave Current Value",
        'ru': "✅ Оставить текущее значение",
        'be': "✅ Пакінуць бягучае значэнне",
        'uk': "✅ Залишити поточне значення",
    },
    'system-color': {
        'en': "System Color",
        'ru': "Системный цвет",
        'be': "Сістэмны колер",
        'uk': "Системний колір",
    },
    'current-value': {
        'en': "Current value: {}",
        'ru': "Текущее значение: {}",
        'be': "Бягучае значэнне: {}",
        'uk': "Поточне значення: {}",
    },
    'advanced-screens': {
        'en': "Advanced Screens",
        'ru': "Продвинутые экраны",
        'be': "Прасунутыя экраны",
        'uk': "Просунуті екрани",
    },
    'back': {
        'en': "Back",
        'ru': "Назад",
        'be': "Назад",
        'uk': "Назад",
    },
    'get-source-code': {
        'en': "Get Source Code",
        'ru': "Получить исходный код",
        'be': "Атрымаць зыходны код",
        'uk': "Отримати вихідний код",
    },
    'bot-maintenance': {
        'en': "Sorry! The bot is currently undergoing maintenance. Launch the bot later",
        'ru': "Сейчас бот находится на техническом обслуживании. Запустите бота позже",
        'be': "Цяпер робат знаходзіцца на тэхнічным абслугоўванні. Запусціце бота пазней",
        'uk': "Зараз робот знаходиться на технічному обслуговуванні. Запустіть бота пізніше",
    },
    'only-ascii-allowed': {
        'en': "Only numbers, Latin letters and punctuation marks are allowed.",
        'ru': "Только цифры, латинские буквы и знаки препинания разрешены.",
        'be': "Толькі лічбы, лацінскія літары і знакі прыпынку дазволеныя.",
        'uk': "Тільки цифри, латинські літери та розділові знаки дозволені.",
    },
    'empty': {
        'en': "empty",
        'ru': "пусто",
        'be': "пуста",
        'uk': "порожньо",
    },
    'bot-name': {
        'en': "PTelegram-Masking",
        'ru': "ПТелеграм-Маскировщик",
        'be': "ПТелеграм-Маскировщик",
        'uk': "ПТелеграм-Маскировщик",
    },
    'bot-description': {
        'en': "Welcome!\n\nThis bot will help you create your unique version of Telegram with the features and settings you need.\n\nClick \"Start\" to get started!",
        'ru': "Добро пожаловать!\n\nЭтот бот поможет создать вашу уникальную версию PTelegram с нужными функциями и настройками.\n\nНажмите «Старт», чтобы начать!",
        'be': "Сардэчна запрашаем!\n\nГэты бот дапаможа стварыць вашу унікальную версію PTelegram з патрэбнымі функцыямі і наладамі.\n\nНацісніце «Старт», каб пачаць!",
        'uk': "Ласкаво просимо!\n\nЦей бот допоможе створити вашу унікальну версію PTelegram з потрібними функціями та налаштуваннями.\n\nНатисніть «Старт», щоб почати!",
    },
    'bot-short-description': {
        'en': "Beware of fakes! Check the bot in the pinned message at @cpartisans_security.\n\nContact: @partisan_telegram_bot.",
        'ru': "Остерегайтесь подделок! Проверьте бота в закрепе в @cpartisans_security.\n\nДля связи: @partisan_telegram_bot.",
        'be': "Сцеражыцеся падробак! Праверце бата ў замацаванке ў @cpartisans_security.\n\nДля сувязі: @partisan_telegram_bot.",
        'uk': "Стережіться підробок! Перевірте бота в закрепі @cpartisans_security.\n\nДля зв'язку: @partisan_telegram_bot.",
    },
}
