#NOTE all language codes are give according to the ISO-639-1
translations = {
    'help': {
        'en': "Supported commands:\n"
            "/build - create an order\n"
            "/status - receive your order status\n"
            "/cancel - cancel your order\n"
            "/help - receive this help message",
        'ru': "Доступные команды:\n"
            "/build - создать заказ\n"
            "/status - показать статус заказа\n"
            "/cancel - отменить заказ\n"
            "/help - показать эту справку",
        'be': "Даступныя каманды:\n"
            "/build - стварыць замову\n"
            "/status - паказаць статус замовы\n"
            "/cancel - скасаваць замову\n"
            "/help - паказаць гэтую даведку",
        'uk': "Доступні команди:\n"
            "/build - створити замовлення\n"
            "/status - показати статус замовлення\n"
            "/cancel - скасувати замовлення\n"
            "/help - показати цю довідку",
    },
    'no-orders-yet': {
        'en': "You have not yet started setting up your version of Partisan Telegram.",
        'ru': "Вы ещё не начали настраивать Вашу версию Партизанского Телеграма.",
        'be': "Вы яшчэ не пачалі настройваць Вашую версію Партызанскага Тэлеграма.",
        'uk': "Ви ще не почали настроювати Вашу версію Партизанського Телеграма.",
    },
    'canceled': {
        'en': "Your order is canceled. Send /build to configure your version of Partisan Telegram again or click the button below this message to clear messages.",
        'ru': "Ваш заказ отменён. Отправьте /build для повторной настройки Вашей версии Партизанского Телеграма или нажмите кнопку под этим сообщением для очистки переписки.",
        'be': "Вашая замова скасаваная. Дашліце /build для паўторнай налады Вашай версіі Партызанскага Тэлеграма або націсніце кнопку пад гэтым паведамленнем для ачысткі перапіскі.",
        'uk': "Ваше замовлення скасувано. Надішліть /build для повторного налаштування Вашої версії Партизанського Телеграма або натисніть кнопку під цим повідомленням для очищення листування.",
        },
    'queued': {
        'en': "Your order is queued for build. Your position in the queue: {}",
        'ru': "Ваш заказ поставлен в очередь на сборку. Ваша позиция в очереди: {}",
        'be': "Вашая замова пастаўленая ў чаргу на зборку. Ваша пазіцыя ў чарзе: {}",
        'uk': "Ваше замовлення поставлено в чергу на збірку. Ваша позиція у черзі: {}",
    },
    'app-name-too-long': {
        'en': "App name is too long. The name must not be longer than {0} characters.",
        'ru': "Слишком длинное название приложения. Название должно быть не длинее {0} символов.",
        'be': "Занадта доўгая назва дадатка. Назва мае быць не даўжэйшай за {0} cімвалаў.",
        'uk': "Занадто довга назва додатку. Назва має бути не довше за {0} символів.",
    },
    'app-name-is': {
        'en': "App name is <b>{0}</b>.",
        'ru': "Название приложения – <b>{0}</b>.",
        'be': "Назва дадатка – <b>{0}</b>.",
        'uk': "Назва додатку – <b>{0}</b>.",
    },
    'app-id-about': {
        'en': "Every Android app has an ID (<i>applicationId</i>), which uniquely identifies the app on the device.",
        'ru': "У каждого Android приложения есть ID (<i>applicationId</i>), который уникально определяет приложение на устройстве.",
        'be': "Кожны Android дадатак мае ID (<i>applicationId</i>), які унікальна вызначае дадатак на прыладзе.",
        'uk': "Кожен Android додаток має ID (<i>applicationId</i>), який унікально визначає додаток на пристрої.",
    },
    'ask-app-id': {
        'en': "Please select application ID or enter it from keyboard. ",
        'ru': "Пожалуйста, выберите ID приложения или введите с клавиатуры. ",
        'be': "Калі ласка, выберыце ID дадатка альбо ўвядзіце з клавіятуры. ",
        'uk': "Будь ласка, виберіть ID додатку або введіть із клавіатури. ",
    },
    'custom-app-id': {
        'en': 'Enter...',
        'ru': 'Ввести...',
        'be': 'Увесьці...',
        'uk': 'Ввести...',
    },
    'ask-custom-app-id': {
        'en': "Please enter the <i>applicationId</i>.\n"
              "Example of a correct ID: <code>{0}</code>.",
        'ru': "Пожалуйста, введите <i>applicationId</i>.\n"
              "Пример правильного ID: <code>{0}</code>.",
        'be': "Калі ласка, увядзіце <i>applicationId</i>.\n"
              "Прыклад правільнага ID: <code>{0}</code>.",
        'uk': "Будь ласка, введіть <i>applicationId</i>.\n"
              "Приклад правильного ID: <code>{0}</code>.",
    },
    'invalid-app-id': {
        'en': "Invalid application ID.\n"
              "See more information <a href=\"{0}\">here</a>.",
        'ru': "Недопустимый ID приложения.\n"
              "Смотрите больше информации <a href=\"{0}\">здесь</a>.",
        'be': "Недапушчальны ID дадатка.\n"
              "Глядзіце больш інфармацыі <a href=\"{0}\">тут</a>.",
        'uk': "Недопустимий ID додатку.\n"
              "Дивіться більше інформаціі <a href=\"{0}\">тут</a>.",
    },
    'app-id-is': {
        'en': "<i>applicationId</i> is {0}",
        'ru': "<i>applicationId</i> приложения — {0}",
        'be': "<i>applicationId</i> дадатка — {0}",
        'uk': "<i>applicationId</i> додатку — {0}",
    },
    'ask-icon': {
        'en': "Please upload the image you want to have as the app's icon.",
        'ru': "Пожалуйста, загрузите изображение, которое хотите сделать иконкой приложения.",
        'be': "Калі ласка, загрузіце выяву, якую хочаце зрабіць іконкай дадатка.",
        'uk': "Будь ласка, завантажте зображення, яке хочете зробити іконкою додатку.",
    },
    'file-too-big': {
        'en': "Your file is too big. Please send a file smaller than {} MB.",
        'ru': "Ваш файл слишком большой. Пожалуйста, загрузите файл меньше {} МБ.",
        'be': "Ваш файл занадта вялікі. Калі ласка, загрузіце файл меншы за {} МБ.",
        'uk': "Ваш файл занадто великий. Будь ласка, завантажте файл менший за {} МБ.",
    },
    'file-is-not-image': {
        'en': "The file is not an image.",
        'ru': "Файл не является изображением.",
        'be': "Файл не з'яўляецца выявай.",
        'uk': "Файл не є зображенням.",
    },
    'grouped-images-are-not-allowed': {
        'en': "You only need to send one image.",
        'ru': "Необходимо прислать только одно изображение.",
        'be': "Неабходна даслаць толькі адну выяву.",
        'uk': "Необхідно надіслати лише одне зображення.",
    },
    'request-confirmation': {
        'en': "Your order is\n{0} ({1})\nMasked Passcode Screen: {2}\nVersion Name: {3}\nVersion Code: {4}\nNotification Text: {5}\nApp Permissions: {6}\nSchedule the build?",
        'ru': "Ваш заказ\n{0} ({1})\nЗамаскированный экран код-пароля: {2}\nНазвание версии: {3}\nНомер версии: {4}\nТекст уведомления: {5}\nРазрешения приложения: {6}\nЗапланировать сборку?",
        'be': "Вашая замова\n{0} ({1})\nЗамаскіраваны экран код-пароля: {2}\nНазва версіі: {3}\nНумар версіі: {4}\nТэкст апавяшчэння: {5}\nДазволы дадатка: {6}\nЗапланаваць зборку?",
        'uk': "Ваше замовлення\n{0} ({1})\nЗамаскований екран код-паролю: {2}\nНазва версії: {3}\nНомер версії: {4}\nТекст сповіщення: {5}\nДозволи додатку: {6}\nЗапланувати збірку?",
    },
    'confirmed': {
        'en': "Your order is confirmed.",
        'ru': "Ваш заказ подтвержён.",
        'be': "Вашая замова пацверджаная.",
        'uk': "Ваше замовлення підтверджено.",
    },
    'awaiting-build': {
        'en': "Your order is awaiting build. If you want to cancel the build please send /cancel.",
        'ru': "Ваш заказ ожидает сборки. Если Вы хотите отменить сборку, пожалуйста, отправьте /cancel.",
        'be': "Вашая замова чакае зборкі. Калі Вы хаціце скасаваць зборку, калі ласка, дашліце /cancel.",
        'uk': "Ваше замовлення чекає на збірку. Якщо Ви хочете скасувати збірку, будь ласка, відправте /cancel.",
    },
    'build-started': {
        'en': "Build of your order is started, it will take some time.",
        'ru': "Сборка вашего заказа началась, она займёт некоторое время.",
        'be': "Зборка вашае замовы пачалася, яна зойме некаторы час.",
        'uk': "Збірка вашого замовлення почалася, вона зойме деякий час.",
    },
    'is-building': {
        'en': "Your order is being built.",
        'ru': "Ваш заказ собирается.",
        'be': "Вашая замова збіраецца.",
        'uk': "Ваше замовлення збирається."
    },
    'build-failed': {
        'en': "Build failed.",
        'ru': "Сборка не удалась.",
        'be': "Зборка не ўдалася.",
        'uk': "Збірка не вдалася."
    },
    'retry-build': {
        'en': "Retry build",
        'ru': "Попробовать заново",
        'be': "Паспрабаваць нанова",
        'uk': "Спробувати заново",
    },
    'cancel-order': {
        'en': "Cancel order",
        'ru': "Отменить заказ",
        'be': "Скасаваць замову",
        'uk': "Скасувати замовлення",
    },
    'welcome': {
        'en': "Welcome! Please send /build to start setting up your version of Partisan Telegram.",
        'ru': "Приветствую! Пожалуйста, отправьте /build для начала настройки Вашей версии Партизанского Телеграма.",
        'be': "Вітаю! Калі ласка, дашліце /build для пачатку наладкі Вашай версіі Партызанскага Тэлеграма.",
        'uk': "Вітаю! Будь ласка, надішліть /build для початку налаштування Вашої версії Партизанського Телеграма.",
    },
    'ask-for-app-name': {
        'en': "How do you want to call your app?",
        'ru': "Как Вы хотите назвать приложение?",
        'be': "Як Вы хочаце назваць дадатак?",
        'uk': "Як Ви хочете назвати додаток?",
    },
    'you-already-started-building': {
        'en': "You have already started setting up the app, {0}.",
        'ru': "Вы уже начали настраивать приложение, {0}.",
        'be': "Вы ўжо пачалі наладжваць дадатак, {0}.",
        'uk': "Ви вже почали налаштовувати додаток, {0}.",
    },
    'status-configuring': {
        'en': "You are setting up your Partisan Telegram.",
        'ru': "Вы настраиваете Ваш Партизанский Телеграм.",
        'be': "Вы настройваеце Ваш Партызанскі Тэлеграм.",
        'uk': "Ви налаштовуєте Ваш Партизанський Телеграм.",
    },
    'status-building': {
        'en': "Your Partisan Telegram is building.",
        'ru': "Ваш Партизанский Телеграм собирается.",
        'be': "Ваш Партызанскі Тэлеграм збіраецца.",
        'uk': "Ваш Партизанський Телеграм збирається.",
    },
    'status-queued': {
        'en': "Your Partisan Telegram is in the queue. Your position in the queue: {}",
        'ru': "Ваш Партизанский Телеграм находится в очереди. Ваша позиция в очереди: {}",
        'be': "Ваш Партызанскі Тэлеграм знаходзіцца ў чарзе. Ваша пазіцыя ў чарзе: {}",
        'uk': "Ваш Партизанський Телеграм перебуває у черзі. Ваша позиція у черзі: {}",
    },
    'status-completed': {
        'en': "The build of your Partisan Telegram is completed or cancelled.",
        'ru': "Сборка Вашего Партизанского Телеграма завершена или отменена.",
        'be': "Зборка Вашага Партызанскага Тэлеграма завершана або адменена.",
        'uk': "Складання Вашого Партизанського Телеграма завершено або скасовано.",
    },
    'status-unknown': {
        'en': "Status unknown.",
        'ru': "Статус неизвестен.",
        'be': "Статус невядомы.",
        'uk': "Статус невідомий.",
    },
    'yes': {
        'en': "Yes",
        'ru': "Да",
        'be': "Так",
        'uk': "Так",
    },
    'no': {
        'en': "No",
        'ru': "Нет",
        'be': "Не",
        'uk': "Ні"
    },
    'status-desc': {
        'en': "Display your order status",
        'ru': "Показать статус вашего заказа",
        'be': "Паказаць статус вашай замовы",
        'uk': "Показати статус вашого замовлення"
    },
    'help-desc': {
        'en': "Display help message",
        'ru': "Показать справку",
        'be': "Паказаць даведку",
        'uk': "Показати довідку"
    },
    'build-desc': {
        'en': "Create an order",
        'ru': "Cоздать заказ",
        'be': "Стварыць замову",
        'uk': "Створити замовлення"
    },
    'cancel-desc': {
        'en': "Cancel order",
        'ru': "Отменить заказ",
        'be': "Скасаваць замову",
        'uk': "Скасувати замовлення",
    },
    'suggest-cancel': {
        'en': "If you wish to change your order, please send /cancel then /build.",
        'ru': "Если Вы желаете изменить заказ, пожалуйста, отправьте /cancel затем /build.",
        'be': "Калі Вы жадаеце змяніць замову, калі ласка, дашліце /cancel затым /build.",
        'uk': "Якщо Ви бажаєте змінити замовлення, будь ласка, відправте /cancel потім /build.",
    },
    'cannot-cancel': {
        'en': "Sorry, cannot cancel the build in progress. Please wait until the build completes",
        'ru': "Извините, не могу отменить заказ во время сборки. Пожалуйста, дождитесь завершения сборки.",
        'be': "Выбачайце, не магу скасаваць замову падчас зборкі. Калі ласка, дачакайцеся заканчэння зборкі.",
        'uk': "Вибачте, не можу скасувати замовлення підчас збірки. Будь ласка, дочекайтеся закінчення збірки."
    },
    'cannot-create': {
        'en': "Sorry, cannot accept a new order during the build of the current order. Please wait until the build completes.",
        'ru': "Извините, не могу принять новый заказ во время сборки текущего заказа. Пожалуйста, дождитесь завершения сборки.",
        'be': "Выбачайце, не магу прыняць новую замову падчас зборкі бягучай замовы. Калі ласка, дачакайцеся заканчэння зборкі.",
        'uk': "Вибачте, не можу прийняти нове замовлення під час збірки поточного замовлення. Будь ласка, дочекайтеся закінчення збірки."
    },
    'media-files-are-not-allowed': {
        'en': "At this stage media files are not allowed.",
        'ru': "На этом этапе медиа-файлы не разрешены.",
        'be': "На гэтым этапе медыя-файлы не дазволены.",
        'uk': "На цьому етапі медіа-файли не дозволені."
    },
    'unknown-text-response': {
        'en': "Please send /build to start setting up your version of Partisan Telegram.",
        'ru': "Пожалуйста, отправьте /build для начала настройки Вашей версии Партизанского Телеграма.",
        'be': "Калі ласка, дашліце /build для пачатку наладкі Вашай версіі Партызанскага Тэлеграма.",
        'uk': "Будь ласка, надішліть /build для початку налаштування Вашої версії Партизанського Телеграма.",
    },
    'build-ended': {
        'en': "Your Partisan Telegram has been built. Install the apk from the post above. Correspondence with the bot will be deleted automatically after {0:.0f} minutes."
              " If you want to delete the conversation right now, click the button below this message.",
        'ru': "Ваш партизанский телеграм собран. Установите apk из сообщения выше. Переписка с ботом удалится автоматически через {0:.0f} минут."
              " Если Вы хотите удалить переписку прямо сейчас, нажмите кнопку под этим сообщением.",
        'be': "Ваш партызанскі тэлеграм сабраны. Усталюйце apk з паведамлення вышэй. Перапіска з ботам выдаліцца аўтаматычна праз {0:.0f} хвілін."
              " Калі Вы жадаеце выдаліць перапіску прама зараз, націсніце кнопку пад гэтым паведамленнем.",
        'uk': "Ваш партизанський телеграм зібрано. Встановіть apk із повідомлення вище. Листування з ботом буде видалено автоматично через {0:.0f} хвилин."
              " Якщо Ви бажаєте видалити листування прямо зараз, натисніть кнопку під цим повідомленням.",
    },
    'clear-bot': {
        'en': "Clear messages",
        'ru': "Очистить переписку",
        'be': "Ачысціць перапіску",
        'uk': "Очистити листування",
    },
    'request-confirmation-again': {
        'en': "Please click one of the buttons above to confirm or cancel the application build.",
        'ru': "Пожалуйста, нажмите на одну из кнопок выше для подтверждения или отмены сборки приложения.",
        'be': "Калі ласка, націсніце на адну з кнопак вышэй для пацверджання або адмены зборкі дадатку.",
        'uk': "Будь ласка, натисніть одну з кнопок вище, щоб підтвердити або скасувати складання додатку.",
    },
    'ask-for-masked-passcode-screen': {
        'en': "Choose what the passcode entry screen will be masked as. " +
              "This screen is what will be visible immediately when the application is launched.\n\n" +
              "<b>Calculator</b> - the passcode entry screen will be masked as a calculator. " +
              "You will need to enter a passcode here to unlock the application.\n" +
              "<i>Pros</i>: Intuitive passcode entry.\n" +
              "<i>Cons</i>: The calculator masking may be too obvious; only numeric passcodes are available.\n\n" +
              "<b>Loading</b> - the passcode entry screen will be masked as a loading screen. " +
              "You will need to tap on different parts of the screen here to enter a passcode.\n" +
              "<i>Pros</i>: Compatible with disguises for a wide variety of applications. The loading screen will look logical with different names and icons.\n" +
              "<i>Cons</i>: It can be difficult to figure out, how to enter a passcode; only numeric passcodes are available.\n\n" +
              "<b>Note</b> - the passcode entry screen will be masked as a note application. " +
              "In it, you will need to create a note with the passcode in the title to unlock the application.\n" +
              "<i>Pros</i>: You can use both numeric passcodes and alphanumeric passwords.\n\n" +
              "After selecting the passcode input screen, the bot will select a random icon, name and other settings for the app. " +
              "You can agree with these random settings or customize the app for yourself.",
        'ru': "Выберите, под что будет маскироваться экран ввода код-пароля. " +
              "Этот экран - то, что будет видно сразу при запуске приложения.\n\n" +
              "<b>Calculator</b> - экран ввода код-пароля будет замаскирован под калькулятор. " +
              "В нём нужно будет ввести код-пароль, чтобы приложение разблокировалось.\n" +
              "<i>Плюсы</i>: интуитивно понятный ввод код-пароля.\n" +
              "<i>Минусы</i>: маскировка под калькулятор может быть слишком очевидной; доступны только цифровые код-пароли.\n\n" +
              "<b>Loading</b> - экран ввода код-пароля будет замаскирован под экран загрузки. " +
              "В нём нужно будет нажимать на разные части экрана, чтобы ввести код-пароль.\n" +
              "<i>Плюсы</i>: Совместимо с маскировкой под очень разные приложения. Экран загрузки будет логично выглядеть с разными названиями и иконками.\n" +
              "<i>Минусы</i>: может быть сложно разобраться, как вводить код-пароль; доступны только цифровые код-пароли.\n\n" +
              "<b>Note</b> - экран ввода код-пароля будет замаскирован под приложение для записок. " +
              "В нём нужно будет создать заметку, в тексте названия которой будет код-пароль, чтобы разблокировать приложение.\n" +
              "<i>Плюсы</i>: Можно использовать как цифровые код-пароли, так и полноценные буквенно-цифровые пароли.\n\n" +
              "После выбора экрана ввода код-пароля бот выберет случайные икноку, название и прочие настройки для приложения. " +
              "Вы сможете согласиться с этими случайными настройками или детально настроить приложение под себя.",
        'be': "Абярыце, пад што будзе маскіравацца экран уводу кода блакіроўкі. " +
              "Гэты экран - тое, што будзе відаць адразу пры запуску дадатка.\n\n" +
              "<b>Calculator</b> - экран уводу кода блакіроўкі будзе замаскіраваны пад калькулятар. " +
              "У ім трэба будзе ўвесці код блакіроўкі, каб дадатак разблакаваўся.\n" +
              "<i>Плюсы</i>: інтуітыўна зразумелы ўвод кода блакіроўкі.\n" +
              "<i>Мінусы</i>: маскіроўка пад калькулятар можа быць занадта відавочнай; даступныя толькі лічбавыя кады блакіроўкі.\n\n" +
              "<b>Loading</b> - экран уводу кода блакіроўкі будзе замаскіраваны пад экран загрузкі. " +
              "У ім трэба будзе націскаць на розныя часткі экрана, каб увесці код блакіроўкі.\n" +
              "<i>Плюсы</i>: можна маскіравацца пад вельмі розныя дадаткі. Экран загрузкі будзе лагічна выглядаць з рознымі назвамі і іконкамі.\n" +
              "<i>Мінусы</i>: можа быць складана разабрацца, як уводзіць код блакіроўкі; даступныя толькі лічбавыя кады блакіроўкі.\n\n" +
              "<b>Note</b> - экран уводу кода блакіроўкі будзе замаскіраваны пад дадатак для запісак. " +
              "У ім трэба будзе стварыць нататку, у тэксце назвы якой будзе код блакіроўкі, каб разблакаваць дадатак.\n" +
              "<i>Плюсы</i>: можна выкарыстоўваць як лічбавыя кады блакіроўкі, так і паўнавартасныя літарна-лічбавыя паролі.\n\n" +
              "Пасля выбару экрана ўводу кода блакіроўкі бот выбера выпадковыя ікноку, назву і іншыя налады для дадатка. " +
              "Вы зможаце пагадзіцца з гэтымі выпадковымі наладамі або дэталёва наладзіць дадатак пад сябе.",
        'uk': "Виберіть, під що маскуватиметься екран введення коду блокування. " +
              "Цей екран - те, що буде видно відразу при запуску додатку.\n\n" +
              "<b>Calculator</b> - екран введення коду блокування буде замаскований під калькулятор. " +
              "У ньому потрібно буде ввести код блокування, щоб додаток розблокувалася.\n" +
              "<i>Плюси</i>: інтуїтивно зрозуміле введення коду блокування.\n" +
              "<i>Мінус</i>: маскування під калькулятор може бути занадто очевидним; доступні тільки цифрові коди блокування.\n\n" +
              "<b>Loading</b> - екран введення коду блокування буде замаскований під екран завантаження. " +
              "У ньому потрібно буде натискати на різні частини екрана, щоб ввести код блокування.\n" +
              "<i>Плюси</i>: Сумісно з маскуванням під дуже різні додаткі. Екран завантаження буде логічно виглядати з різними назвами та іконками.\n" +
              "<i>Мінус</i>: може бути складно розібратися, як вводити код блокування; доступні тільки цифрові коди блокування.\n\n" +
              "<b>Note</b> - екран введення коду блокування буде замаскований під додаток для записок. " +
              "У ньому потрібно буде створити замітку, в тексті назви якої буде код блокування, щоб розблокувати прліоження.\n" +
              "<i>Плюси</i>: Можна використовувати як цифрові коди блокування, так і повноцінні буквено-цифрові паролі.\n\n" +
              "Після вибору екрана введення коду блокування бот вибере випадкові іконку, назву та інші налаштування для додатку. " +
              "Ви зможете погодитися з цими випадковими налаштуваннями або детально налаштувати додаток під себе.",
    },
    'ask-for-notification-color': {
        'en': "Choose the color of the notification icon. We recommend choosing a color that is close to the color of the application icon.",
        'ru': "Выберите цвет иконки уведомления. Рекомендуем выбрать цвет, который близок к цвету иконки приложения.",
        'be': "Выберыце колер іконкі апавяшчэння. Мы рэкамендуем выбраць колер, блізкі да колеру іконкі дадатка.",
        'uk': "Виберіть колір іконки сповіщення. Ми рекомендуємо вибрати колір, близький до кольору іконки додатку.",
    },
    'ask-for-version-name': {
        'en': "Enter the app version name. The version name usually consists of several numbers separated by points. For example, 1.2.3 or 10.17.6d.",
        'ru': "Введите название версии приложения. Название версии обычно состоит из нескольких чисел, разделённых точками. Например, 1.2.3 или 10.17.6d.",
        'be': "Увядзіце назву версіі дадатку. Назва версіі звычайна складаецца з некалькіх лічбаў, падзеленых кропкамі. Напрыклад, 1.2.3 або 10.17.6d.",
        'uk': "Введіть назву версії додатку. Назва версії зазвичай складається з декількох чисел, розділених точками. Наприклад, 1.2.3 або 10.17.6d.",
    },
    'ask-for-version-code': {
        'en': "Enter the app version code. The code must be an integer number. For example, 123 or 42.",
        'ru': "Введите код версии приложения. Код должен быть целым числом. Например, 123 или 42.",
        'be': "Увядзіце код версіі дадатку. Код павінен быць цэлым лікам. Напрыклад, 123 ці 42.",
        'uk': "Введіть код версії додатку. Код повинен бути цілим числом. Наприклад, 123 або 42.",
    },
    'version-code-must-be-integer': {
        'en': "The code must be an <b>integer</b> number.",
        'ru': "Код должен быть <b>целым</b> числом.",
        'be': "Код павінен быць <b>цэлым</b> лікам.",
        'uk': "Код повинен бути <b>цілим</b> числом.",
    },
    'ask-for-notification-text': {
        'en': "Enter the text of the notification that will be displayed instead of telegram notifications. For example, \"Update Available!\".",
        'ru': "Введите текст уведомления, которое будет отображаться вместо уведомлений Телеграма. Например, \"Доступно обновление!\".",
        'be': "Увядзіце тэкст апавяшчэння, якое будзе адлюстроўвацца замест апавяшчэнняў па тэлеграме. Напрыклад, \"Абнаўленне даступна!\".",
        'uk': "Введіть текст сповіщення, яке відображатиметься замість телеграмських сповіщень. Наприклад, \"Оновлення доступне!\".",
    },
    'ask-for-permissions': {
        'en': "Select the permissions that will be available to the application.\n\n" +
              "The fewer permissions you select, the less suspicious the app will potentially be. " +
              "For example, it may be suspicious that a calculator has access to photos and videos.\n\n" +
              "On the other hand, the fewer permissions you select, the more difficult it will be to use the application." +
              "For example, if you disable access to photos and videos, you will not be able to send photos to chats." +
              "In addition, reducing available permissions may cause the application to not work correctly even if it seems that " +
              "you do not use these permissions in any way.",
        'ru': "Выберите разрешения, которые будут доступны для приложения.\n\n" +
              "Чем меньше разрешений будет выбрано, тем, потенциально, меньше подозрений приложение будет вызывать. " +
              "Например, может быть подозрительно, что калькулятор имеет доступ к фото и видео.\n\n" +
              "С другой стороны, чем меньше разрешений будет выбрано, тем сложнее будет пользоваться приложением." +
              "Например, если отключить доступ к фото и видео, Вы не сможете отправлять фото в чаты." +
              "Кроме того, уменьшение доступных разрешений может привести к некорректной работе приложения даже если кажется, " +
              "что Вы никак не используете эти разрешения.",
        'be': "Абярыце дазволы, якія будуць даступныя для дадатка.\n\n" +
              "Чым менш дазволаў будзе абрана, тым, патэнцыйна, менш падазрэнняў дадатак будзе выклікаць. " +
              "Напрыклад, можа быць падазрона, што калькулятар мае доступ да фота і відэа.\n\n" +
              "З іншага боку, чым менш дазволаў будзе абрана, тым складаней будзе карыстацца дадаткам." +
              "Напрыклад, калі адключыць доступ да фота і відэа, Вы не зможаце адпраўляць фота ў чаты." +
              "Акрамя таго, памяншэнне даступных дазволаў можа прывесці да некарэктнай працы дадатка нават калі здаецца, " +
              "што Вы ніяк не выкарыстоўваеце гэтыя дазволы.",
        'uk': "Виберіть дозволи, які будуть доступні для додатку.\n\n" +
              "Чим менше дозволів буде обрано, тим, потенційно, менше підозр додаток буде викликати. " +
              "Наприклад, може бути підозріло, що калькулятор має доступ до фото та відео.\n\n" +
              "З іншого боку, чим менше дозволів буде вибрано, тим складніше буде користуватися програмою." +
              "Наприклад, якщо вимкнути доступ до фото та відео, Ви не зможете надсилати фото в чати." +
              "Крім того, зменшення доступних дозволів може призвести до некоректної роботи додатку навіть якщо здається," +
              "що Ви не використовуєте ці дозволи.",
    },
    'permission-camera': {
        'en': "Camera",
        'ru': "Камера",
        'be': "Камера",
        'uk': "Камера",
    },
    'permission-location': {
        'en': "Location",
        'ru': "Местоположение",
        'be': "Месцазнаходжанне",
        'uk': "Геодані",
    },
    'permission-microphone': {
        'en': "Microphone",
        'ru': "Микрофон",
        'be': "Мікрафон",
        'uk': "Мікрофон",
    },
    'permission-notifications': {
        'en': "Notifications",
        'ru': "Уведомления",
        'be': "Апавяшчэнні",
        'uk': "Сповіщення",
    },
    'permission-photos_and_video': {
        'en': "Photos and video",
        'ru': "Фото и видео",
        'be': "Фота і відэа",
        'uk': "Фото й відео",
    },
    'permission-contacts': {
        'en': "Contacts",
        'ru': "Контакты",
        'be': "Кантакты",
        'uk': "Контакти",
    },
    'permission-music_and_audio': {
        'en': "Music and audio",
        'ru': "Музыка и аудио",
        'be': "Музыка і аўдыя",
        'uk': "Музика й аудіо",
    },
    'permission-call_logs': {
        'en': "Call logs",
        'ru': "Список вызовов",
        'be': "Журналы выклікаў",
        'uk': "Журнали викликів",
    },
    'permission-phone': {
        'en': "Phone",
        'ru': "Телефон",
        'be': "Тэлефон",
        'uk': "Телефон",
    },
    'permission-nearby_devices': {
        'en': "Nearby Devices",
        'ru': "Устройства поблизости",
        'be': "Прылады паблізу",
        'uk': "Пристрої поблизу",
    },
    'permission-sms': {
        'en': "SMS",
        'ru': "SMS",
        'be': "SMS",
        'uk': "SMS",
    },
    'check-all': {
        'en': "Check All",
        'ru': "Выбрать все",
        'be': "Выбраць усе",
        'uk': "Вибрати всі",
    },
    'clear-all': {
        'en': "Clear all",
        'ru': "Очистить все",
        'be': "Ачысціць усе",
        'uk': "Очистити всі",
    },
    'continue': {
        'en': "Continue",
        'ru': "Продолжить",
        'be': "Працягнуць",
        'uk': "Продовжити",
    },
    'start-build': {
        'en': "Start Build",
        'ru': "Начать сборку",
        'be': "Пачаць зборку",
        'uk': "Почати складання",
    },
    'customize-settings': {
        'en': "Customize Settings",
        'ru': "Изменить настройки",
        'be': "Змяніць налады",
        'uk': "Змінити налаштування",
    },
    'flood-wait': {
        'en': "You have recently built an application. The next time you will be able to build an application is {0}.",
        'ru': "Вы недавно уже собирали приложение. Следующий раз Вы сможете собрать приложение {0}.",
        'be': "Вы нядаўна ўжо збіралі дадатак. Наступны раз Вы зможаце сабраць дадатак {0}.",
        'uk': "Ви нещодавно вже збирали додаток. Наступного разу Ви зможете зібрати додаток {0}.",
    },
}
